{"file_name": "2012_UNI_brochure.pdf", "source_path": "data/raw_pdfs/2012_UNI_brochure.pdf", "content": "Destination \nBrochure\nTo Book A Complete Vacation, \nContact Your Preferred Travel Professional\n\n\nWhere  \nVacation  \nBecomes \nAdventure\n1\nYou want a vacation. But not just any vacation. You want an adventure that catapults \nyou away from the everyday. One that changes “next Tuesday” into “the day our \nflight leaves and I cannot stop thinking about it!” In three words, what you want is: \nUniversal Orlando® Resort.\nBecause this is the only place where you can do incredible things like soar over \nHogwarts™ with Harry Potter™ and his friends. Or save the city from certain doom \nwith Spider-Man. ® Or join Homer, Marge, Bart, Lisa and Maggie and feel what it’s \nlike to spend a day in Krustyland with The Simpsons. ™ These are the stars of the \nbiggest movies, TV shows, and storybooks in history–and you’re going to pack \nyour days full of playing, laughing and screaming along with them.\nCome escape from the routine, even if just for a while. Remember what it’s like to \nnot have deadlines or meetings or errands or chores. Instead come make some of the \nmost incredible memories you can. It’s all yours and it’s only at Universal Orlando \nResort, where you can be courageous, be outrageous and be extraordinary.\n\n3\n2\nUNIVERSAL ORLANDO® RESORT\n1 Universal Orlando Resort Overview  \n2\n Universal Orlando Resort Map\n4\n Universal’s Islands of Adventure® Overview\n6\n The Wizarding World of Harry Potter™ \n \n \nOverview\n8\n Universal’s Islands of Adventure Map\n10\n Universal Studios Florida® Overview\n12\n Universal Studios Florida Map\n \n14\n Universal CityWalk® Overview\n16\n Universal CityWalk Map\n  \n18\n Vacation Upgrades\n18\n Special Events\n \nON-SITE HOTELS AT UNIVERSAL ORLANDO\n20 On-Site Hotels Overview & Benefits  \n22\n Loews Portofino Bay Hotel\n \n24\n Hard Rock Hotel® \n26\n Loews Royal Pacific Resort\n \nACCOMODATIONS\n28 V acation Packages \n30\n Univ\nersal Partner Hotel Listings\n \n34\n V\nacation Add-Ons\n35 Des\ntination Map\nTICKET & VACATION OPTIONS\n37 Tick ets & Vacation Add-Ons\n38\n Dining Options\n39 Orlando Fle\nxTicketTM\nTerms & Conditions\n40 T erms & Conditions\nTable of \nContents\nImagine all the once-in-a-lifetime memories you’ll make while you’re here! You \nwon’t have a day without something to do when you’ve got two amazing theme \nparks, a huge entertainment complex, and three world-class on-site hotels all right \nnext to each other.\nTheme park thrills and excitement? Look no further. Some of the greatest stories in \nhistory and pop culture come alive as insanely innovative rides and attractions at \nUniversal’s Islands of Adventure. ® And pass through the arches of Universal Studios \nFlorida, ® and you’ll become part of some of the biggest movies and TV shows ever.\nThe Universal CityWalk® entertainment complex has everything else your vacation \ncould want: dining, shopping, dancing, movies, live entertainment and more, including \nthe incomparable Blue Man Group.\nAnd the best part? Everything is within walking distance, including three uniquely \nthemed on-site hotels. You don’t want to fill your days with hours of parking, shuttles, \nand endless walking just to get from one adventure to another. So it’s all here. In one \nplace. And it’s all waiting for you.\n\n  THE AMA\nzING ADVENTURES OF SPIDER\n-MAN®                                               \nHeroes of legend. Stories that transcend generations. Epic adventures \nand unforgettable journeys. This is Universal’s Islands of Adventure, \nyour own personal playground. It’s also the only place in the world \nwhere you can journey into The Wizarding World of Harry Potter,TM \nwhere magic is real and excitement knows no bounds. Because in \nthese lands, the world’s biggest stories come to life and there’s no \ntelling what might happen next.\nPulse-Pounding Thrills\nLooking to shift your adrenaline into overdrive? Strap yourself into \nedge-of-your-seat roller coasters like Dragon ChallengeTM and \nThe Incredible Hulk Coaster. ®  Bust up a band of super-villains in \n3-D on The Amazing Adventures of Spider-Man. ® Then soar above \nthe castle grounds on a groundbreaking ride that lets you join \nHarry PotterTM and his friends on an unforgettably thrilling adventure.\nFor the Young and Young at Heart\nOld enough to laugh? Then there’s an adventure here for you. \nExplore the whimsical world of Dr. Seuss in the wonky Seuss Landing.TM  \nCheer for the good guys at a super-hero parade in Marvel Super \nHero Island. ® And if you like a bit of danger mixed with your science, \ntake the kids to the prehistoric Jurassic Park. ®  Because really, \nyou’re never too young or too old for a little excitement.\nExciting Shows\nSome of the best stories just have to be told live. So duck and cheer \nand gasp to the action-packed stunts  of The Eighth Voyage of \nSindbad. ® Then venture undersea in the special effects spectacular, \nPoseidon’s Fury. ®\nUniversal’s\nIslands of\nAdventure\n®\nTheme Park\n       MARVEL SUPER HERO ISLAND\n®  \n       DRAGON\n CHALLENGE\n™  \n            JURASSIC PARK\n®  \n5\n4\n\nThe Wizarding \nWorld of  \nHarry Potter\nTM\nOnly at Universal’s\nIslands of Adventure®\nFrom printed page to the silver screen, you’ve shared his every \nadventure. Now prepare to join Harry PotterTM and his friends  \nas you step into the magic and excitement of The Wizarding World  \nof Harry Potter.TM\nExperience exciting rides like Dragon Challenge,TM twin high-speed \nroller coasters that put you right in the middle of the Triwizard \nTournamentTM ; and the Flight of the Hippogriff,TM a family coaster \nthat takes you on a fun ride through the skies over Hagrid’s hut \nand the castle grounds. Plus, enter HogwartsTM itself and explore \nthe familiar passageways, classrooms and corridors leading to \nHarry Potter and the Forbidden Journey,TM a thrilling state-of-\nthe-art ride that brings the magic, characters, and stories of \nHarry Potter to life in ways never before experienced.\nIn addition to the rides, you’ll walk past the Hogwarts Express  \nand explore the streets of Hogsmeade,TM where you can visit the \nshops and sample fare from the wizarding world’s best-known \nestablishments. Dine at the Three BroomsticksTM and enjoy a  \nrefreshing taste of Butterbeer or pumpkin juice at the Hog’s Head \npub. Pick up some wizarding supplies at Dervish and Banges.TM  \nStop at HoneydukesTM where you’ll find confectionery ranging from \nChocolate Frogs TM and Bertie Bott’s Every-Flavour Beans TM to  \nCauldron Cakes and treacle fudge. Purchase a wand at Ollivanders.TM \nFind a selection of novelty items, jokes and toys at zonko’s \nJoke Shop. Then visit the Owl PostTM and send a letter with a \nHogsmeade postmark.\nTM\n       BUTTERBEER\n  \n       FLIGHT OF THE HIPPOGRIFF\n™  \n       OLLIVANDERS™  \nThe Wizarding\nWorld of Harry Potter\nTM\nExclusive Vacation Package\n4-Night Getaways start from only $315* per adult, tax inclusive!\nOnly available through Universal Parks & Resorts Vacations® view details on page 29\nPrices subject to change.\n7\n6\n\nSeuss Landing\nTM\nl1 Caro-Seuss-elTM The world’s most unusual merry-go-round.\nl2 The Ca t in the Hat TM Whirl through the pages of the famous children’s book.\nl3 If I Ran the zooTM Explore the wondrous interactive playground.\nl4 One Fish, T wo Fish, Red Fish, Blue Fish TM Steer your fish through an obstacle course of fountains.\nl5 The High In The Sk y Seuss Trolley Train Ride!TM A high flying ride through Dr. Seuss’s imagination.\nnA Gr een Eggs and Ham TM Cafe Counter Service\nnB Cir cus McGurkus Cafe Stoo-pendous TM            Counter Service\nThe Lost Continent®\nl6 Poseidon’s F ury® Special effects-filled adventure.\nl7 The Eigh th Voyage of Sindbad® Spectacular live stunt show.\nl8 The Mys tic Fountain Match wits with the talking, squirting fountain.\nnC Mythos R estaurant® Table Service\nThe Wizarding World\nof Harry Potter\nTM\nl9 Dr agon Challenge TM A high-speed roller coaster chase across the sky. \nl10 Fligh t of the Hippogriff TM Swoop and soar on this family-friendly coaster.\nl11 Harry Po tter and the Forbidden Journey TM Join Harry PotterTM  \nand his friends on a groundbreaking adventure.\nnD Thr ee Broomsticks TM Counter Service\nJurassic Park®\nl12 Camp Jur assic® Run, climb and explore in this prehistoric playground.\nl13 Pt eranodon Flyers® Soar through the air on a gliding roller coaster for kids.\nl14 Jur assic Park River Adventure® Escape the jaws of a T-rex on a river raft.\nl15 Jur assic Park Discovery Center® Get hands-on with the mysteries of the past.\nnE The Bur ger Digs®                       Counter Service\nnF Pizza Pr edattoria® Counter Service\nnG Thunder F alls Terrace® Counter Service\nToon Lagoon®\nl16 Dudle y Do-Right’s Ripsaw Falls® Fun & hilarious flume ride.\nl17 Me Ship , The Olive® This multi-level ship playground is an ocean of fun. \nl18 Pope ye & Bluto’s Bilge-Rat Barges® Brave white-water rapids in this churning raft ride. \nnH Blondie’s  Counter Service\nnI Wimp y’s Counter Service\nnJ C omic Strip Cafe®                       Counter Service  \nMarvel Super Hero Island®\nl19 The Amazing A dventures of Spider-Man® Swing above the streets in 3-D.\nl20 Doc tor Doom’s Fearfall® Takes fear to new heights—150 ft. straight up.\nl21 The Incr edible Hulk Coaster® Feel the rage on a high-speed roller coaster rampage.\nl22 St orm Force Accelatron® Spin as you summon the forces of nature.\nnK Captain America Diner®  Counter Service\nnL Caf e 4 SM Counter Service\nPort of Entry®\nnM Cr oissant Moon Bakery® Counter Service\nnN C onfisco Grill ® and Backwater Bar Table Service/Character Dining\nl1\nl10 \nl15 \nl21 \nl6 \nl2\nl11 \nl16 \nl22 \nl7 \nl3\nl12 \nl17 l8 \nl4\nl13 \nl18 \nl9 \nl5 \nl14 \nl19 \nl20 nA\nnB\nnC\nnD\nnE\nnF\nnG\nnH\nnInJ\nnK\nnL\nnM\nnN\nOn-Site Hotel Guests Receive  \nExCLu\nSIVE\n Theme Park Benefits.  \nSee page 21 for details.\nl A ttractions\nn Dining\n Univ\nersal Meal Deal  \nRefer to page 38 for details.\n9\n8\n\nun iversal\nStudios \nFlorida\n®\n \nTheme Park\nWhy just go to the movies when you can become a part of them! \nStep through the massive arches of Universal Studios Florida,  \nand take a starring role in some of the biggest movies and TV \nshows ever created. And while every stunt, scream and scare  \nare delivered with Hollywood flair, they’re all just backdrops  \nfor the memories you’ll make.\nAction-Packed  \nAdventure and Thrills\nYou can’t have a movie without someone yelling “Action!”, and  \nyour vacation is no different. Crank up the intensity when you pick \nyour own roller coaster soundtrack on Hollywood Rip Ride Rockit®  \nor face down hordes of the undead on Revenge of the Mummy. ®  \nThen careen and crash your way through Krustyland on  \nThe Simpsons Ride. TM If you like your movies with more  \nexplosions than tender moments, climb aboard.\nFor the Young and Young at Heart\nNo matter how old you get, there’s always a part of you that loves \nto play and laugh and forget about all that boring “adult” stuff. \nSo come help save Princess Fiona with everyone’s favorite ogre in \nShrek 4-D. Fly your bicycle across the stars to E.T.’s home world on \nthe heartwarming E.T. Adventure. ® And new in 2012, join the world’s \nmost lovable super-villain, Gru, and his minions in an all-new 3-D \nadventure based on the hit film Despicable Me. You’ll find plenty to \ndo if you’re five or just channeling your inner five-year-old.\nFun Shows For the Whole Family\nAnd here’s the whole point of the vacation—to do stuff together. \nSo you can remember when mom laughed so hard at the Horror \nMake-Up Show that she started crying. Or when the kids were \nsinging their heads off at Beetlejuice’s Graveyard Revue.TM\n  SHREK 4-\nD                                                             \n  MEN IN BLACK\n™ ALIEN ATTACK\n™      \n  THE SIMPSONS RIDE\n™      \n  NEW IN 2012! DESPICABLE ME ATTRACTION      \n11\n10\n\nProduction Central\nl1 Holly wood Rip Ride Rockit® Take your music on a high-speed roller coaster ride.\nl2 Shr ek 4-D  A totally in-your-face fairy tale adventure.\nl3 Despicable Me A ttraction 3-D ride based on the hit film, NEW IN 2012. \nnA Univ ersal Studios’ Classic Monsters Cafe Counter Service\nNew York\nl4 T wister...Ride It Out® Experience what it’s like to be a real storm chaser.  \nl5 R evenge of the Mummy® A psychological thrill ride 3000 years in the making.\nl6 The Blues Br others® Enjoy a Chicago-style street party with live music and more.\nnB Finnegan’s B ar & Grill Table Service\nnC L ouie’s Italian Restaurant            Counter Service\nSan Francisco\nl7 Bee tlejuice’s Graveyard Revue TM Live rock ‘n’ roll spooktacular show.\nl8 Disas ter! SM A major motion picture ride...starring YOU.\nnD Rich ter’s Burger Co. Counter Service\nnE L ombard’s Seafood Grille Table Service\nnF Midw ay Grill Counter Service\nWorld Expo\nl9 MEN IN BL ACK TM Alien AttackTM zap aliens and save the galaxy. \nl10 The Simpsons RideTM Crash through Krustyland.\nnG In ternational Food & Film Festival            Counter Service\nWoody Woodpecker’s \nKidZone®\nl11 Animal Ac tors on Location! SM A live show that’s more fun than humanly possible. \nl12 A  Da y in the Park with Barney TM Sing and clap along with Barney.®\nl13 Curious Geor ge Goes To Town SM Storybook water play area for kids. \nl14 W oody Woodpecker’s Nuthouse Coaster® The nuttiest kids’ roller coaster ever. \nl15 Fie vel’s Playland® A playground with a mouse-eye view of the world. \nl16 E. T. Adventure® Ride your bike across the stars.\nnH Kid zone Pizza C ompany Counter Service\nHollywood\nl17 Univ ersal Orlando’s Horror Make-Up Show Behind the scenes of make-up effects.\nl18 TERMINA TOR 2®: 3-D A live show where the future of humanity is in your hands.  \nl19 Luc y – A Tribute SM Celebrating the life and career of Lucille Ball.\nnI Be verly Hills Boulangerie Counter Service\nnJ Sch wab’s Pharmacy Counter Service\nnK Mel’s Driv e-In            Counter Service\nnL Caf e La Bamba Counter Service\nOn-Site Hotel Guests Receive  \nExCLu\nSIVE\n Theme Park Benefits.  \nSee page 21 for details.\nl Attractions\nn Dining\n Univ\nersal Meal Deal  \nRefer to page 38 for details.\nl1 \nl13 \nl19 \nl6 \nl2 \nl9 \nl14 \nl7 \nl3 \nl10 \nl15 \nl8 \nl4 \nnB\nnC\nnD\nnE\nnF\nnG\nnH\nnI\nnJ\nnK nL\nl11 \nl16 \nl5 \nl12 \nl17 \nl18 \nnA\n13\n12\n\nUniversal\nCityWalk\n®\nEntertainment Complex\n  CITYWALK\n’S RISING STAR                                  \n  LATIN q\nUARTER\n™     \n  BLUE MAN GROUP      \nSM\n       ELEMENT\n  \n      JIMMY BUFFETT’S® MARGARITAVILLE®  \nA vacation can’t just be all fun and games, can it? Oh, it \ncan? And you want more fun and games? OK! How about \nUniversal CityWalk, an entire entertainment complex \nwhere you can dine, dance and play the night away!\nJust outside both theme parks is the best in restaurants, \nnightclubs, shopping, movies and more. Grab a quick \nbite or a coffee in the morning, shop and dine at your \nleisure throughout the day, and party the night away \nuntil 2 am.\nRestaurants\nTake your taste buds on a world-class vacation to \nsome of Orlando’s best casual and fine dining stops.  \nYou can kick back in island bliss at Jimmy Buffett’s® \nMargaritaville® or feel the rush of a motorcar speedway \nat NASCAR Sports Grille.SM Get a taste of New Orleans at \nEmeril’s® Restaurant Orlando,  or travel further south for \nthe churrascaria Brazilian steakhouse experience inside \nLatin \nq\nuarter. ™ Whatever you’re in the mood for, we’ve \ngot a spot for you. \nNightclubs & Entertainment\nAfter filling your days with the greatest thrills in Orlando, \ntop it off with live music, dancing, and more at incredible \nnightclubs. Enjoy some tropical cool at Red Coconut Club® \nor a Cajun street party at Pat O’Brien’s, ® a replica of the \niconic New Orleans watering hole. From dance floor to \nkaraoke stage, these are nights you’ll never forget!\nShopping & Movies\nLooking to pick up a few things to take home? You \ncan find everything from surfboards to sarongs as you \nexplore unique shops and boutiques, including Fossil, ® \nElement, Hart & Huntington Tattoo Company, ® and \nmore. And if you want to just sit back for a few hours, \nyou can catch the latest Hollywood hits at the state-of- \nthe-art AMC® Universal Cineplex 20 with IMAX. ®\nBlue Man Group\nFor a truly outrageous live show, you won’t want to miss \nBlue Man Group. This world-renowned show is a curiously \ncaptivating mash-up of totally unique live music,  \nunexpected humor, the meaning of connected-ness, \nand lots of paint. It’s a show you don’t just watch— \nyou become a part of it. Separately ticketed show.\n15\n14\n\nCityWalk \nParty PassSM\nWhen the live music starts at night, some  \nclubs add a cover charge for entrance (hours vary  \nby venue). If you’d like to experience all the excitement  \na night at CityWalk® has to offer, grab a CityWalk Party Pass  \nand skip the cover charge at every club. * You also enjoy all-club  \naccess with any multi-day theme park ticket or vacation package booked  \nthrough Universal Parks & Resorts Vacations® .\n*Not valid for separately ticketed concerts and special events. Some venues require ages 21 or older for \nadmission. Valid photo ID required. Does not include movie at AMC® Universal Cineplex 20 with IMAX® or the \nBlue Man Group show. Subject to availability. Restrictions apply and benefits are subject to change without notice.\nl1 \nl15 \nl6 \nl2 \nl11 \nl16 \nl7 \nl12 \nl17 \nl8 \nl13 \nl9 \nl14 \nl10 \nl3 \nl4 \nl5 \nl19\nl18 \nDining & Entertainment\nl1 R ed Coconut Club® Add some life to your night at CityWalk’s ultra lounge, where tropical meets \ntrendy and the nightlife is always hot.\nl2 Bob Marle y – A Tribute to Freedom SM  Enjoy live music nightly and authentic Jamaican and \nCaribbean cuisine.\nl3 P at O’Brien’s® Orlando This replica of the famed New Orleans watering hole  \nfeatures the original flaming fountains patio and piano bar.\nl4 the gr oove SM Hit the hottest dance club in town, featuring the latest in \nsound systems and special effects, three themed lounges and more.\nl5 La tin q uarterTM Enjoy the culture and cuisine of all 21 Latin nations,  \nplus a Churrascaria steakhouse experience upstairs.  \nLive entertainment nightly.\nl6 Jimm y Buffett’s® Margaritaville® Enjoy live entertainment, sip the  \nultimate margarita, and savor your cheeseburger in a tropical paradise.\nl7 L one Palm Airport Full menu and bar, sandy play area, and  \nJimmy Buffett’s own sea plane the “Hemisphere Dancer.”\nl8 Bubba Gump Shrimp C o.TM Restaurant & Market It’s shrimp, shrimp,  \nand more shrimp plus great steaks, sandwiches, and mouth-watering desserts.\nl9 P astamoré SM Treat yourself to exceptional Italian cuisine in a colorful Mediterranean  \nsetting or dine al fresco in the marketplace café.\nl10 Cit yWalk’s Rising Star Belt out your favorite songs as the lead singer of a live band, \ncomplete with backup singers, at a rock ‘n’ roll karaoke bar!    \nl11 Emeril’s® R estaurant Orlando Experience the imaginative and sophisticated cuisine  \nthat has made Emeril Lagasse the country’s hottest chef. “BAM!”\nl12 NB A City Let the award winning food and authentic NBA flavor take you courtside,  \nplay a little one-on-one, and pick up authentic gear.\nl13 Har d Rock Cafe® Orlando Grab a burger and a side order of rock ‘n’ roll history  \nat the world’s largest Hard Rock Cafe.\nl14 Har d Rock Live® Orlando See the biggest names in music take the stage at Orlando’s premier \nperformance venue.\nl15 NAS CAR Sports Grille SM Find yourself bumper to bumper with rows of racing machines and \nmemorabilia at the only official NASCAR® eatery in Florida.\nl16 Hart & Hun tington Tattoo Company® Get some ink, pick up authentic H&H gear, and see what  \nhas made the reality TV show Inked a national hit!\nl17 AMC® Univ ersal Cineplex 20 with IMAX® Orlando’s film showplace with 20 screens, stadium \nseating, and state-of-the-art sound and projection systems.\nl18 Holly wood Drive-In Golf Grab a putter and try your hand at 36 holes of mini golf on two classic \ndrive-in movie themed courses.\nl19 Blue Man Gr oup This live show is a unique combination of music, comedy and multimedia \ntheatrics that creates a blissful party atmosphere.\nQuick Service Options\n Cinnabon® Fresh, hot out-of-the-oven cinnamon rolls. Enjoy the original Cinnabon plus \nPecanbons,TM Minibons,TM and more.\n F\nat Tuesday® Cool off with frozen drinks at a convenient walk-up counter.\n F\nusion Bistro Sushi & Sake Bar Enjoy sushi and Japanese fusion dishes as well as fruit-infused sakes.\n Moe’s South\nwest Grill Get ready for giant burritos, cheesy quesadillas and flavorful salads \nprepared right before your eyes.\n P\nanda Express Grab a plate of their original Orange Chicken or zesty Beijing Beef wok-ed up \nfresh, hot and fast.\n Starbucks® C\noffee Enjoy specialty coffees and teas, blended drinks, and bakery items.\n \nTCBY® Cool off with delectable frozen yogurt served cones, sundaes, parfaits and more.\n \nWhopperTM Bar Enjoy the flame-broiled burger you love with over a million ways to have it your way. ®\n17\n16\n\nAdd an extra layer of excitement to your  \nvacation with a live show, water theme park or by  \nvisiting during one of our incredible special events.\nBlue Man Group\nThis world-renowned show is a curiously captivating mash-up of \ntotally unique live music, unexpected humor, and lots of paint. \nEven before the house lights dim, you’ll start to experience the \nhumor and style that you’ll only find with Blue Man Group. And \nonce the show starts, you’ll never want it to end. Every minute is \npacked with their unique form of entertainment: original musical \ninstruments, a live band, inventive comedy, audience interaction, \nand multimedia theatrics that all combine to create a blissful party \natmosphere. People of all ages agree: Blue Man Group is a totally \noutrageous experience. Blue Man Group performs live in the Sharp \nAq\nUOS Theatre at Universal CityWalk. ®\nWet ‘n Wild®\nThrills are for sharing! Only Wet ‘n Wild Orlando gives you more \nthemed, multi-person thrill rides than any other water park \naround. Signature hits like Disco H20, ™ Brain Wash, ™ Bubba Tub, \nThe Flyer and more—hi-speed, seriously twisted, multi-person \nfamily adventures that let you experience the excitement with up \nto four people at a time. You’ll also find an exciting wave pool, a \nlaid back Lazy River, and a special play area just for the little ones. \nSo whether you visit the park with friends or family, Wet ‘n Wild \nmakes it easy to feel the fun and Share the Rush!\nBlue Man Group and Wet ‘n Wild tickets can be \nadded to vacation packages booked through \nUniversal Parks & Resorts Vacations® .\nSpecial Events\nNobody throws a party like Universal Orlando. ® From live concerts to \nannual special events to holiday celebrations, Universal Orlando has \nsomething to delight every member of the family. \nMARDI GRAS (February – April) \nEnjoy live concerts, authentic Cajun and Creole cuisine, a spectacular \nparade, and beads by the handful.\nSUMMER CONCERT SERIES (June – July) \nFire up your summer with some of today’s hottest performers  \nlive in concert.\nHALLOWEEN HORROR NIGHTS® (September – October) \nThe nation’s premier Halloween event features terrifying \nhaunted houses, live shows, and countless terrors in the dark.\nHOLIDAY FESTIVITIES (December) \nUniversal Orlando decks the halls with colorful decorations, holiday \nmusic, themed shows, and other unique celebrations.\nBlue Man Group, Wet ‘n Wild and Halloween Horror Nights are not included with your regular \ntheme park admission.\nup grade Your\nVacation\nBLUE MAN GROUP\n           HALLOWEEN\n HORROR\n NIGHTS\n®   \n           W\nET ‘N WILD\n®   \n           M\nARDI GRAS   \n19\n18\n\nStay in the Heart  \nof the Excitement\nTo make your vacation at Universal Orlando® Resort even more \nincredible, look no further than our three on-site hotels. The \nimpeccable service, crystal clear pools and luxurious rooms are just \nthe start of what you can expect from these award-winning hotels. \nYou’re also within walking distance—or a short, complimentary \nwater taxi ride—from both theme parks and Universal CityWalk. ®\nThere are also exclusive benefits to staying on-site. For starters, \nyou get to skip the regular lines for free at participating attractions \nwith UNIVERSAL EXPRESSSM ride access. You can also have anything \nyou purchase in the parks sent directly to your room, so you don’t \nhave to carry it around all day. And that’s just a few of the things \nyou’ll love about staying with us.\nYou can choose from one of three uniquely themed on-site hotels: the \nluxurious Loews Portofino Bay Hotel, the electrifying Hard Rock Hotel® \nor the exotic Loews Royal Pacific Resort. No matter where you stay, \nwhen you stay on-site, you’re right in the heart of the excitement.\nLooking for the  \nBest Days to Vacation?\n*\n \nTake advantage of the LOWEST rates of the season! Plus, enjoy  \n$150 in hotel savings including discounts on food, drinks,  \nspa treatments and more!\n• Jan 1 – Feb 16, 2012 • Aug 12 – Oct 4, 2012  \n• Nov 25 – Dec 20, 2012\nChoose from any of the \nthree on-site hotels\nUniversal Orlando®\nOn-Site\nHotels\nExclusive  \nTheme Park Benefits:\n• Early Park Admission† to The Wizarding World of Harry PotterTM, \none hour before the theme park opens\n• Universal ExpressSM ride access^ — a FREE benefit worth up to $87 per person, per day^ ^  \n• Complimentary water taxis or shuttle buses to make getting around the resort  \nfast and easy so you can make the most of your time \n• Priority seating at select restaurants \n• Complimentary delivery of merchandise purchased throughout the resort to your hotel room\n• Resort-wide charging privileges with your room key card\n• Universal Orlando character dining with some of your favorite theme park characters\n*Minimum of three night stay required.  Reservations must be made in advance of arrival and are subject to availability.  Blockout dates may apply. Savings Guide will be distributed upon check-in while supplies last.  Savings Guide is subject to change without \nnotice and is non-refundable and non-transferable.  Travel must be completed during promotional weeks listed. †Requires paid theme park admission. Early Park Admission begins one hour prior to Universal’s Islands of Adventure regular opening hour for on-\nsite hotel guests and is valid 7 days a week for travel now – 12/31/12, valid only at Harry Potter and the Forbidden Journey™, Flight of the Hippogriff™, Dragon Challenge™ and The Cat in the Hat™. Universal Express ride access is not valid during Early Park \nAdmission. Additional restrictions may apply and the foregoing benefits are subject to change without notice. ^Not valid at Harry Potter and the Forbidden Journey and other select attractions. On-site hotel privileges good for hotel stay as indicated on the room \nkey card. Only good for the number of guests staying in the room. Paid theme park admission required. Express ride access available during normal theme park operating hours only. Not valid for separately ticketed special events. ^ ^Based on peak pricing for \nthe Unlimited Express pass, sold exclusively at the Universal Orlando® theme park front gates.\n21\n20\n\nAccommodations  \n• 750 stylish guest rooms, including 45 spacious suites \nf\neaturing one king bed or two queen beds\n•\n Rooms start at 4\n50 sq. ft. and feature a 32” flat panel \ntelevision, Italian furnishings & marble accents\n• Rooms can accommodate up to five^ with a rollaway \nfor an additional charge\n•\n Deluxe Club rooms offer exclusive benefits including  \ncomplimentary continental breakfast each morning \nand admission to the Mandara Spa® and fitness center\n•\n Themed Kids’ Suites with separate bedrooms f\nor adults \nand kids\nDining \nTake a culinary tour of Italy with eight restaurants and \nlounges, including the world famous Bice Ristorante. \nDine on traditional  specialties right from Mama Della’s \nRistorante,SM laugh along with Universal Orlando ®  \nCharacter Dining, or toast among friends at a harborside \nItalian wine bar. No matter where you dine or relax, \nyou’ll  find the charm of Italy throughout.\nRecreation \nYou’ll find something for everyone at one of our three \nswimming pools: Beach Pool complete with water slide, \nVilla Pool featuring private cabanas and the Hillside \nPool for a more quiet locale. From the live Italian music \non the harbor piazza to the relaxing Mandara Spa to the \nCampo Portofino® supervised kids’ camp, there truly is \nsomething for everyone to enjoy.\nExperience La Dolce Vita – The Sweet Life \nTake a trip to the stunning seaside village of Portofino, Italy at Loews Portofino Bay Hotel at Universal Orlando. \nLuxurious rooms, authentic Italian specialties, and warm hospitality make your stay here a taste of what the  \nItalians call la dolce vita—the sweet life. From the cobblestone streets to the outdoor cafés, you just may forget \nwhat country you’re in. P\nLUS\n, \nON\n-\nSITE\n \nHOTEL\n \nGUESTS\n \nENJOY\n \nEXCLUSIVE\n \nTHEME\n \nPARK\n \nBENEFITS\n \nINCLUDING\n FREE \nU\nNIVERSAL\n E\nXPRESS\n \nTO\n \nSKIP\n \nTHE\n \nREGULAR\n \nLINES\n.*\nLoews Portofino \nBay Hotel\n       MANDARA\n SPA  \n23\n22\n*See page 21 for more details. ^Only one rollaway is allowed per room. King \nRooms have bedding for 2, requires rollaway for 3. Double Queen have bedding \nfor 4, requires rollaway for 5. Available on a first come first serve basis.\n\nAccommodations  \n• 650 guest rooms, including 29 suites featuring one \nking bed or two queen beds\n• Standard rooms start at 375 sq. ft. and feature stylish \nfurnishings and rock ‘n’ roll artwork\n• Rooms can accommodate up to five^ ^ with a rollaway \nfor an additional charge\n• Guests staying in Club Level rooms and suites  \nenjoy exclusive benefits including complimentary \ncontinental breakfast each morning and admission  \nto The Workout Room fitness center\n• Rock ‘n’ roll-themed Kids’ Suites with separate \nbedrooms for adults and kids\nDining \nWhat would a rock star’s mansion be without electrifying \ndining options? Find the flavor that suits your style \nfrom five restaurants and lounges, including Palm \nRestaurant, the famed New York steakhouse. Eat \nwhere some of your favorite celebrities cooked their \nfavorites at The Kitchen, take part in Universal Orlando® \nCharacter Dining, or just grab a bite in your room after \na late night at Universal CityWalk. ® \nRecreation \nEver rocked out underwater? Take a dip in our rock star \nswimming pool, complete with underwater music, sand \nbeach, and waterslide. Need more to do? Check out The \nWorkout Room fitness center with steam and sauna \nrooms, Camp Lil’ Rock® supervised kids’ camp, or enjoy \nlive entertainment from legendary superstars at Velvet \nSessions* monthly rock ‘n’ roll cocktail party!\nLive Like A Rock ‘n’ Roll Superstar \nIt’s the perfect mix of funk and just plain fun. It’s classy, yet totally casual. Lively, yet laid back. It’s the coolest \nhotel in town, and you’ll feel like you just stepped off the stage, surrounded with the music, style, and irreverent \nattitude of the rock ‘n’ roll lifestyle. P\nLUS\n, \nON\n-\nSITE\n \nHOTEL\n \nGUESTS\n \nENJOY\n \nEXCLUSIVE\n \nTHEME\n \nPARK\n \nBENEFITS\n \nINCLUDING\n \nFREE U\nNIVERSAL\n E\nXPRESS\n \nTO\n \nSKIP\n \nTHE\n \nREGULAR\n \nLINES\n. ^\nHard Rock\nHotel®\n  VELVET BAR       \n25\n24\n^See page 21 for more details. ^^Only one rollaway is allowed per room. \nKing Rooms have bedding for 2, requires rollaway for 3. Double Queen have \nbedding for 4, requires rollaway for 5. Available on a first come first serve \nbasis. *Excludes Nov. and Dec. Separately ticketed event. Fees will apply to \nonline advance purchases. Dates, times, admission, ticket price, entertain-\nment and benefits subject to change without notice. Must be 21 or older for \nadmission. Valid photo ID required.\n\nAccommodations  \n• 1,000 guest rooms, including 51 suites f eaturing one \nking bed or two queen beds\n•\n Standard rooms start at 33\n5 sq. ft. and exude  \nthe warmth and charm of the South Seas\n• Rooms can accommodate up to five^ ^ with a rollaway \nfor an additional charge\n•\n Guests staying in Club Level rooms or suites \n \nenjoy exclusive benefits including complimentary \ncontinental breakfast each morning and admission  \nto The Gymnasium fitness center\n•\n Jurassic Park® themed Kids’ Suites with separate \nbedrooms for adults and kids\nDining \nTaste all the flavors of the islands with six restaurants \nand lounges. The Wantilan Luau* is a traditional Hawaiian \ndinner show that features live music and hula dancing—\nyou might even find yourself on stage! No matter where \nyou eat—from celebrity chef Emeril Lagasse’s take on \nPolynesian cuisine at Emeril’s Tchoup Chop to a popular \nsushi bar—the tastes of the South Seas will delight your \nevery taste bud.\nRecreation \nSwim, play and relax around the lagoon-style pool \ncomplete with a sand beach, cabana rentals, and an \ninteractive water play area for the kids. Or just hit  \nThe Gymnasium’s whirlpool, steam room or sauna.  \nDrop the kids off at The Mariner’s Club supervised \nkids’ camp or enjoy a game of shuffleboard or beach \nvolleyball. The islands are yours for the playing.\nKick Back And Relax In A Tropical Paradise \nHere you’ll explore an island of comfort, style and sophistication at Loews Royal Pacific Resort. Experience the \nwonder of such island paradises as Fiji, Bali and Hawaii. From lush landscaping to the white sandy beach of the \nlagoon-style swimming pool, you’ll be surrounded by the tantalizingly exotic. P\nLUS\n, \nON\n-\nSITE\n \nHOTEL\n \nGUESTS\n \nENJOY\n \nEXCLUSIVE\n \nTHEME\n \nPARK\n \nBENEFITS\n \nINCLUDING\n FREE U\nNIVERSAL\n E\nXPRESS\n \nTO\n \nSKIP\n \nTHE\n \nREGULAR\n \nLINES\n. ^\nLoews Royal \nPacific Resort\n       WANTILAN LUAU  \n27\n26\n^See page 21 for more details. ^^Only one rollaway is allowed per room. \nKing Rooms have bedding for 2, requires rollaway for 3. Double Queen have \nbedding for 4, requires rollaway for 5. Available on a first come first serve \nbasis. *Select evenings. Separately ticketed event.\n\nun iversal  \nParks & Resorts \nVacations®\nCreate Your \nIdeal Vacation\nCreate your complete vacation package quickly and easily with Universal Parks & Resorts \nVacations®. With us, you can get everything you desire AND enjoy special benefits. When \nyou purchase a vacation package through Universal Parks & Resorts Vacations, you’ll receive \nEarly Park Admission◊ to The Wizarding World of Harry Potter™! With this benefit, you’ll get \na head start and save time so that you can fit even more fun into your day!\nBook with universal Parks  \n& Resorts Vacations today!\nAll prices, package inclusions & options subject to availability and to change without notice and additional restrictions may apply. Errors will be corrected where discovered, and Universal Orlando and Universal Parks & Resorts Vacations reserve the right \nto revoke any stated offer and to correct any errors, inaccuracies or omissions, whether such error is on this website or any print or other advertisement relating to these products and services. ◊Requires theme park admission. Early Park Admission \nbegins one (1) hour prior to Universal’s Islands of Adventure regular scheduled park opening for Universal Parks & Resorts Vacations guests who purchase a vacation package including hotel and theme park tickets. Current offer valid 7 days a week for \ntravel 1/1 - 12/31/12; valid only at Harry Potter and the Forbidden Journey™, Flight of the Hippogriff™, Dragon Challenge™ and The Cat in the Hat™. *Rate is per adult, tax inclusive based on double adult occupancy for a 4-night stay at the Quality Inn \nInternational standard room. Room type, hotel, and travel dates selected subject to availability. Rate valid for bookings 1/1 –12/15/12 and travel 1/1 - 2/10/12; 4/26 - 6/15/12; 8/26 - 9/30/12; 11/1 - 12/22/12. Other hotels and rates are available. 4-Night \nminimum stay required for travel 3/19 - 4/15/12; 6/11 - 8/26/12; 11/19 - 11/25/12; 12/17 - 12/31/12. 2-Night minimum stay required for remaining travel dates. ^Rate is per adult, tax inclusive and based on double adult occupancy for a 3-night stay at \nthe Best Western Orlando Gateway, standard room. Subject to availability, room type, hotel, and travel dates selected. Rate valid for bookings 1/1 - 12/18/12 and travel 1/1 - 12/24/12. Reservation must be made 72 hours in advance. Additional hotels and \nrates available. †Rate is based on double adult occupancy for a 3 night stay at the Loews Royal Pacific Resort and valid for bookings now–12/16/12 and travel 1/1–2/16/12; 8/12–10/4/12; 11/25–12/20/12. Additional on-site hotels, rates and travel dates \navailable. Universal Parks & Resorts Vacations is registered with the State of Florida as a seller of travel. Registration number ST-24215.\nThe Official \nTravel Company of \nUniversal Orlando® Resort\nFrom hotels to airfare to rental cars to theme park \ntickets and much more, we have everything you \nneed to design the ideal vacation for your family \nin one simple, easy and convenient transaction. \nWe also offer exclusive vacation add-ons such \nas Universal ExpressSM Plus ride access, character \nbreakfasts, the Universal Meal Deal, and much \nmore! See a complete listing of all available \nvacation add-ons on page 34. You can choose \nfrom a wide selection of on-site or off-site hotels \nthat offer the perfect accommodations to meet \nyour needs. Pick the hotel that’s best for  \nyou based on location, price, amenities and more. \nOur award winning on-site hotels are featured on \npages 20–27 and off-site Universal Partner Hotels \nstart on page 30. \nTurn to the experts at Universal Parks & Resorts \nVacations to plan your getaway filled with the \nutmost in action, fun & excitement!\nThe Wizarding World of Harry Potter™ –  \nExclusive Vacation Package  \nAsk your travel provider about this EXCLUSIVE package that is only available \nthrough Universal Parks & Resorts Vacations that includes:\n     • 4-Night Hotel Accommodations \n     • 3-Day Theme Park tickets – one theme park, per day\n     • Early Park Admission\n◊ to experience The Wizarding World  \n        of Harry Potter before the rest of the general public \n     • Breakfast at the Three Broomsticks™ - one per person\n     • And much more!\nStarting from only $315* per adult, tax inclusive!\n3-Night Getaways \nIf you’re looking for a standard hotel & theme park ticket package, take \nadvantage of our 2-PARK Getaway which includes hotel accommodations, \ntheme park tickets, Early Park Admission and more! \nStarting from only $249^ per adult, tax inclusive!\nOr upgrade to one of three on-site hotels\nStarting from $509† per adult, tax inclusive!\n29\n28\n       THREE BROOMSTICKS™  \n       HOLLYWOOD RIP RIDE ROCKIT®  \n\nFOuR POINTS BY SHERATON  \nS\nT\nu\nDIO CITY\nLocated on the world-famous International Drive, just minutes from \nUniversal Orlando®, you’ll find a collection of  \nrestaurants, shopping and attractions nearby.  \n  • Free high-speed internet access and 24-hour fitness center  \n  • Includes breakfast for two at our full-service restaurant   \n  • Heated swimming pool, game room and laundry facilities\nCOCO KEY HOTEL AND  \nWATER RESORT – ORLANDO\nWe make guests happy at Orlando’s newest canopy-covered and outdoor water \nresort! Located on International Drive central to all area attractions. \n  • 54,000 sq. ft. water resort with 3 pools  \n  • 14 slides and interactive play island  \n  • Modern décor rooms, 3 restaurants and  \n     a 6,500 sq. ft. Key West arcade\nBEST WESTERN  \nPLu\nS ORLANDO GATEWAY\nWithin walking distance to exciting shopping, dining  \nand entertainment, this full-service hotel provides family  \nfriendly accommodations.  \n  • Full-service restaurant, lounge and deli  \n  • Heated pool, whirlpools, tennis and basketball courts    \n  • Free wireless internet access, parking, fitness center  \n     and business center\nHOLIDAY INN RESORT ORLANDO –  \nTHE CASTLE \nProvides guests with a royal experience full of magic and  \nenchantment, combining artistic flare and playful luxury within its \nmedieval-inspired walls, creating an atmosphere guests of all ages are \nsure to love. \n  • Newly renovated guest suites with internet access  \n  • Heated outdoor pool with a fountain and nightly dive-in movie  \n  • Castle Café serving daily continental breakfast \nHOLIDAY INN E xPRESS  \nHO\nTEL & S\nu\nITES\nNear Universal Orlando, this property offers a towering 11-story  \nbuilding that features comfortable rooms and suites and service that will sur -\npass your every expectation.  \n  • Deluxe hot continental breakfast  \n  • Outdoor heated pool with sundeck  \n  • Universal Orlando Ticket Center\nHILTON GARDEN INN\nNear Universal Orlando and hundreds of dining, shopping  \nand entertainment venues all accessible on the I-Ride Trolley.  \nRooms feature mini-fridge, microwave and coffee maker.  \n  • Free American breakfast buffet and wireless internet  \n  • Free fitness and business centers, parking, and no resort fees  \n  • On-site restaurant and Tiki Bar lounge with  \n     10 poolside cabanas\nHAMPTON INN\nConveniently located near Universal Orlando, this hotel  \nfeatures many amenities including an on-site  \nconvenience store and guest activity/recreation desk in  \nthe hotel lobby.  \n  • Complimentary hot breakfast and breakfast-to-go options  \n  • Free high-speed internet access and fitness center  \n  • Free 24 hour coffee and tea in lobby\nFAIRFIELD INN & S uITES\nNEAR uNIVERSAL\nThis newly renovated hotel promises a great stay right  \nfrom the start.  \n  • Complimentary continental breakfast  \n  • Exercise room  \n  • Non-smoking hotel\nEMBASSY S uITES  \nINTERNATIONAL DRIVE/JAMAICAN COuRT\nLocated at International Drive and Jamaican Court,  \nthis full-service property offers spacious two-room suites  \nas well as extra amenities.  \n  • Complimentary cooked-to-order breakfast  \n  • Free cocktails each evening  \n  • All suite rooms\nECONOLODGE INN & S uITES\nValue, comfort, and convenience makes this hotel  \na family favorite . \n  • Heated swimming pool and jacuzzi  \n  • Wireless high-speed internet and game room  \n  • Complimentary full access to nearby YMCA Acquatic Family Center\nDOuBLETREE BY HILTON AT THE  \nENTR\nANCE TO \nu\nNIVERSAL ORLANDO\nEnjoy the world famous cookies upon arrival in this full-service hotel!  \nThe spacious guest rooms include 2 queen or 1 king bed and the Sweet Dreams \nBedding Package plus: \n  • 32” flat screen TV’s, mini-refrigerator and coffee maker  \n  • Starbucks, deli, bar and full-service restaurant  \n  • Heated Jr. Olympic-size pool, whirlpool, fitness center  \n     and game room\nBonus Benefits Hotel\nSee page 40 for AAA Diamond Rating System\nCROWNE PLAZA ORLANDO\nuNIVERSAL BLVD.\nWith convenient access to all major area attractions, this resort is the \nideal choice. \n  • Full-service restaurant and bar  \n  • Complimentary on-site parking; no resort fee  \n  • Complimentary internet access in public areas and business center\nCOuNTRY INN & S uITES\nLocated near Universal Orlando, this property offers guest rooms and \nsuites with all the amenities needed for a great trip. \n  • Complimentary Be Our Guest Hot Breakfast Daily  \n  • Gift shop, fitness center and game room  \n  • Complimentary high-speed internet access\nCOMFORT S uITES ORLANDO\nThis property offers all suite hotel accommodations,  \nideal for all travelers offering comfort, convenience and  \nunsurpassed hospitality.  \n  • Complimentary hot savory breakfast & weekday newspaper  \n  • Complimentary wireless internet  \n  • Complimentary fitness center, game room, pool & jacuzzi\nHOLIDAY INN & S uITES\nAT ENTRANCE TO uNIVERSAL ORLANDO\nMake yourself at home in a spacious guest room or suite at our newly \nmodernized property. \n  • On-site TGI Fridays restaurant  \n  • Outdoor heated pool with kids splash zone   \n  • Game room and fitness center\nun iversal  \nPartner \nHotels\nChosen based on quality, reputation and proximity \nto Universal Orlando® the Universal Partner Hotels \nare each located within minutes of Universal Orlando \nResort.  From value to moderate to luxury  \naccommodations, the Universal Partner Hotels offer \nmany ideal options.  In addition to the wide range \nof accommodations our Universal Partner Hotels  \noffer, guests can also enjoy additional BONUS \nBENEFITS at some of our partner hotels.\nGuests staying at hotels noted by the  \nstar symbol (starting on page 30)  \nreceive the following Bonus Benefits: \n• Discounts on merchandise† at select theme  \n   park locations.\n• Discounts on food and non-alcoholic  \n   beverages at select theme park and  \n   CityWalk® locations.\n• Golf Universal Orlando® benefits including tee  \n   times and complimentary transportation††.\nParticipating Universal Partner Hotels subject to change without notice. †Not valid with any other offers, promotions or discounts. Benefits subject to change \nwithout notice. Discounts are not valid at The Wizarding World of Harry Potter. Excludes all Harry Potter merchandise available at Islands of Adventure \nTrading Company and Universal Studios Store, film, batteries, candy, tobacco, sundries, and media. Benefits not valid after checkout date. ††Complimentary \ntransportation for groups of 20 or more is based upon availability and requires a 45-day advance booking.\n31\n30\n\n\nun iversal  \nPartner Hotels\nContinued\nWINGATE BY WYNDHAM\nWithin one mile of Universal Orlando this designated  \nGreen Lodging hotel offers ideal accommodations for all travelers.  \n  • Complimentary extended hot breakfast  \n  • Spa, fitness center and outdoor pool   \n  • In-room complimentary high-speed internet access \nTHE RITZ-CARLTON ORLANDO,  \nGRANDE LAKES\nInspired architecturally by the grand palazzos of Italy, the resort  \nfeatures an on-site Fly Fishing School, Eco-Tours and a wide variety  \nof dining options.  \n  • 40,000 sq. ft. spa  \n  • Greg Norman designed 18-hole championship golf course  \n  • Kids programs\nROSEN INN \nStaying at this hotel within two miles of Universal Orlando  \nputs guests within minutes of Orlando’s attractions and all that \nInternational Drive has to offer.  \n  • Three dining options, Kids Eat Free program  \n  • Outdoor pool and game room  \n  • International pub\nTHE PEABODY ORLANDO\nThis hotel’s beautifully decorated and equipped guest rooms  \nprovide an unmatched level of personal comfort and indulgence.  \n  • 3 Resort pools including the Grotto Pool with a 20-foot waterslide  \n  • 11 restaurants, 24 hour room service & 4 lounges  \n  • Full-service spa\nROSEN INN AT POINTE ORLANDO\nMinutes from Universal Orlando® and close to shopping, movies  \nand many restaurants. This family friendly hotel provides a great  \nlocation for your Orlando vacation.  \n  • Buffet restaurant, sports bar, 24 hour market,  \n     Starbucks and gift shop  \n  • Kids 9 and under eat free (with adult, buffet only)  \n  • Game Room, 3 pools, free wi-fi and parking\nQuALITY INN & S u ITES\nLocated in the heart of the world-famous International Drive  \narea, this hotel puts you just minutes from all there is to see  \nand do in Orlando.  \n  • Suites include refrigerator, microwave and  \n     separate seating area  \n  • Complimentary continental breakfast  \n  • Non-smoking hotel\nQuALITY INN INTERNA TIONAL\nWithin walking distance to exciting shopping, dining and  \nentertainment, this lively hotel provides family friendly  \naccommodations in the heart of Orlando’s famous  \nInternational Drive.  \n  • Family buffet restaurant, English-style pub, mini-market/deli      \n     and gift shop  \n \n • Kids 9 and under eat free (with adult, buffet only)  \n  • Game room, 2 pools, free wi-fi and parking\nORLANDO HOTEL & S uITES\nLocated near Universal Orlando, walk to over 30 restaurants,  \nshops & attractions. I-Ride Trolley service available to area  \nmalls & attractions.  \n  • Kids eat free program  \n  • Free high-speed internet access, parking & local calls    \n  • Microwave and refrigerator in every room \nLA QuINTA INN & S uITES\nFeatures a sun-drenched lobby, whirlpool, gazebo, meeting rooms and \nfitness center. \n  • Free Bright Side Breakfast and free internet  \n  • Courtyard with heated pool   \n  • Fitness center\nJW MARRIOTT ORLANDO,  \nGRANDE LAKES\nThis resort is situated on 500 acres of lush tropical landscaping at  \nthe Headwater of the Everglades with an on-site Fly Fishing School  \nand Eco-Tours. \n  • Wide variety of dining options  \n  • Lazy river pool   \n  • 40,000 sq. ft. spa\nNICKELODEON S uITES RESORT\nHave the SLIME of your life at the fantastic family-friendly  \nresort featuring two giant waterparks. Spacious 2-bedroom  \nKidSuites sleep up to six people and offer a separate living area  \nwith a kitchenette.  \n  • Live Nickelodeon shows, games and SLIME!  \n  • Giant Water Park with slides, billiards, mini-golf and basketball    \n  • Meet SpongeBob SquarePants and Dora the Explorer  \n     at Character Breakfast every morning\nINTERNATIONAL PALMS  \nRESORT ORLANDO\nWith easy access to many Orlando attractions, this hotel is the ideal \nvacation destination for the entire family. \n  • Full-service restaurant and 2 lounges on-site  \n  • Heated resort style swimming pool with waterfall   \n  • Newly renovated fitness center\nHYATT PLACE\nHyatt Place is a new kind of hotel that puts style,  \ninnovation and the Hyatt Touch within everyone’s reach.  \n  • Complimentary continental breakfast  \n  • Free wireless internet   \n  • Swimming pool & fitness center\nHOMEWOOD S uITES BY HILTON\nThis spacious 5-story hotel features “home-like” one bedroom suites \nwith separate living, dining, and sleeping areas. \n  • Complimentary breakfast buffet  \n  • Evening Welcome Home reception (Mon-Thurs) featuring full   \n dinner f\nare, beer, wine, and assorted beverages  \n  • In-room fully equipped kitchens\nTraveling with \na large party?\nWe also offer additional accommodation options featuring 2 & 3 bedroom suites \n(sleep up to 12 guests) that come with a fully equipped kitchen, washer & dryer, living \nand dining areas and much more. Spend your Orlando vacation at one of these spectacular \nproperties! Ask your travel professional for details.\n33\n32\nBonus Benefits Hotel\nSee page 40 for AAA Diamond Rating System\n\n\nON-SITE HOTELS AT \nu\nNIVERSAL ORLANDO® \nl1 L oews Portofino Bay Hotel\nl2 Har d Rock Hotel® \nl3 L oews Royal Pacific Resort\nHOTELS IN THE AREA\nl4 Winga te by Wyndham\nl5 F airfield Inn & Suites Near Universal\nl6 Holida y Inn Express Hotel & Suites\nl7 C omfort Suites Orlando \nl8 DoubleT ree Hotel by Hilton \nat the Entrance to Universal Orlando\nl9 Holida y Inn & Suites  \nat the Entrance to Universal Orlando\nl10 Hy att Place\nl11 Hilt on Garden Inn\nl12 Homew ood Suites by Hilton\nl13 F our Points by Sheraton Studio City\nl14 R osen Inn \nl15 In ternational Palms Resort Orlando\nl16 Bes t Western Plus Orlando Gateway\nl17 C ountry Inn & Suites\nl18 Hampt on Inn\nl19 Cr owne Plaza Orlando Universal Blvd.\nl20 q uality Inn & Suites\nl21 C oco Key Hotel and Water Resort – Orlando\nl22 q uality Inn International\nl23 Embass y Suites International Drive/Jamaican Court\nl24 Orlando Ho tel & Suites \nl25 Holida y Inn Resort Orlando – The Castle\nl26 La q uinta Inn & Suites\nl27 E conoLodge Inn & Suites\nl28 R osen Inn At Pointe Orlando\nl29 The Peabody Orlando\nl30 JW Marrio tt Orlando, Grande Lakes\nl31 The Ritz -Carlton Orlando, Grande Lakes\nl32 Nick elodeon Suites Resort \nAREA SHOPPING\nnA The Mall A t Millenia\nnB Orlando Pr emium Outlets International Dr.\nnC F estival Bay Mall\nnD The Florida Mall\nnE Orlando Pr emium Outlets Vineland Ave.\nl1 \nl2 \nl3 \nl4 \nl5 \nl6 \nl7 l8\nl9\nl10\nl11\nl13l12\nl22\nl21\nl15\nl14\nl20\nl19\nl17\nl18\nl16\nl23\nl27\nl28\nl24\nl25\nl26\nl29\nl32\nl30\nl31\nnA\nnB\nnC\nnD\nnE\nVacation Add-Ons\nUniversal Parks & Resorts Vacations® offers a wide variety of options and extras to help \nyou create the ideal Orlando vacation experience. Certain items frequently sell out, so \nbook your vacation add-ons in advance to make sure you make the most of your vacation. \nCustomize your getaway with any number of vacation add-ons including: \nAir Inclusive Vacations\nAdd flights on major airlines within the United States, Canada and San Juan, Puerto Rico \nto your vacation.\nAirport Transfers\nquick and affordable roundtrip transportation between Orlando International Airport  \nand local ho\ntels via shuttle or meet and greet service.\nArea Attraction Tickets\nIn addition to Universal Orlando® admission, you can purchase tickets to many of Central \nFlorida’s other popular area attractions. \nDining Options\nDining at Universal Orlando Resort can be just as fun and exciting as experiencing our \nworld-renowned rides and attractions. From full-service gourmet cuisine to quick and \nconvenient counter service, you’ll find something to please every palate. See additional \ninformation on page 38. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDisney Area Transportation\nFor guests staying at a Walt Disney World® Resort area hotel we offer  \nround-trip shuttle transportation to Universal Orlando. \nRental Car\nWhether you want to cruise around town in a convertible or save money with an economy \ncar, we can make arrangements for the vehicle that best meets your needs.\nUniversal ExpressSM Plus Pass\nSkip the regular lines* at many rides and attractions throughout the theme parks with a \nUniversal Express Plus Pass!\nGuests staying at an on-site hotel receive  \nFREE Universal ExpressSM ride access.** \n(paid theme park admission required)\nVacation Protection Plan\nCovers many emergency and unexpected situations prior to and during your vacation. \nThis plan also provides trip cancellation coverage in the event of involuntary job loss^. The \npolicy includes: trip cancellation and interruption, medical expenses up to $10,000 and \nemergency medical transport up to $25,000, travel delay, baggage delay and loss.\nVIP Tours\nEnjoy a personally guided walking tour around one or both Universal Orlando theme \nparks. In addition, the VIP Tour includes priority entry into the rides and attractions, so \nyou won’t have to wait in the regular lines.  \nSee all Vacation Ticket Add-Ons on page 37. \n*Not valid at Harry Potter and the Forbidden JourneyTM and other select attractions. Valid one hour after park opening. Limit \none reserved ride per participating attraction using the Universal Express queue. Anticipated wait time 15 minutes. Additional \nrestrictions may apply and benefits are subject to change without notice. **Restrictions apply. For full details and restrictions \nsee page 20. ^Vacation Protection Plan includes coverage for unforeseen covered events such as trip cancellation due to \ninvoluntary Termination of Employment or Layoff. Coverage will only be provided to insureds who have been employed by the \nsame company for at least one year. Insurance only valid for residents of the United States and Canada. Universal Parks & \nResorts Vacations is registered with the State of Florida as a seller of travel. Registration number ST-24215.\nUNIVERSAL ORLANDO RESORT IS NOT AFFILIATED WITH WALT DISNEY WORLD® RESORT.\n35\n34\n   UNIVERSAL MEAL DEAL    \n  WET ‘N WILD® ORLANDO  \n  UNIVERSAL EXPRESS\nSM PLUS PASS      \n   VIP TOURS    \n\n36\nUniversal Parks & Resorts Vacations® offers a wide variety of options to help you create the ideal vacation experience. Certain items frequently sell out, so book your options in advance.\nVacation Ticket Add-Ons\nAdditional restrictions apply to all ticket/add on products and all offers, prices, benefits and entertainment are subject to change without notice. *Savings when compared to the same ticket purchased at Universal Orlando theme park front \ngates. †All ticket products are valid during normal theme park operating hours only. Parks, attractions, or entertainment may: close due to refurbishing, capacity, weather or special events; change operating hours; and otherwise change or be \ndiscontinued without notice. Valid photo ID required. Ticket products are not valid for separately ticketed events at either of the Universal theme parks or within any of the CityWalk venues; do not include admission to AMC Universal Cineplex 20 or \nthe Blue Man Group Show; and, do not include parking or discounts on food or merchandise. \n*Not valid at Harry Potter and the Forbidden JourneyTM and other select attractions. Valid one hour after park opening. Limit one reserved ride per participating attraction using the Universal Express queue. Anticipated wait time 15 minutes.  \nAdditional restrictions may apply and benefits are subject to change without notice. **Paid theme park admission required. For on-site hotel guest benefit, different restrictions apply. For full details and restrictions see page 20.\nTickets & Vacation Add-Ons\nUniversal ExpressSM\nPlus Pass\nBlue Man Group\nWet ‘n Wild® Orlando\nVip Tours\nArea Attraction  \nTickets\nRedefine entertainment with Blue Man Group, a curiously captivating mash-up of totally unique live music, \nunexpected humor and lots of paint. Located at Universal CityWalk’s Sharp Aq\nUOS Theatre.\nWith more multi-passenger tube rides than any other water park in Orlando, Wet ‘n Wild is the perfect place  \nfor the entire family to relax, have fun and enjoy the warm Florida sun.\nSkip the regular lines* at many rides and attractions throughout the Universal Orlando theme parks with a \nUniversal Express Plus pass! Guests staying at an on-site hotel receive FREE Universal ExpressSM ride access** .\nThe VIP Tour allows you and/or your party to be personally escorted on a guided walking tour around one or  \nboth of the two (2) Universal Orlando Resort theme parks.\nIn addition to Universal Studios® and Universal’s Islands of Adventure® admission, you can purchase tickets to \nmany of Central Florida’s other popular area attractions.\nYour Ticket. Your Choice. \nYour Savings.\n37\nUniversal Orlando® Resort lets you create the ticket that’s just right for you and your family. Buy as many days as you like, then add park-to-park access \nfor the upmost in flexibility. IT’S ALL UP TO U!\nSelect Your Days & Options\n• Choose how many days you’d like to visit. \n• Add Park-to-Park Access to visit both parks on the same day for your convenience. \n• Both parks are packed with action and excitement, so plan on at least three days to see it all. \n• 4-Day Base with Park-To-Park Access Ticket available for less than $39 per day!\nThe best way to do and see it all is with a multi-day ticket. Free access to live entertainment at Universal CityWalk® is included with any multi-day ticket \npurchase. For the best value, purchase the 3-Park Unlimited ticket which allows you to visit Universal Studios® , Universal’s Islands of Adventure® , and \nWet ‘n Wild as much as you like within a 14-day period for one low price.\nBUY YOUR TICKETS IN ADVANCE AND SAVE! \nS\nAVE\n $20* OFF \nTHE\n F\nRONT\n G\nATE\n \nPRICES\n \nWHEN\n \nYOU\n \nBUY\n \nA\n \nMULTI\n-\nDAY\n \nTICKET.\n \n\nAdd these dining options to any Universal Orlando® visit for  \nmemorable experiences and incredible savings!\nCharacter Dining\nTurn your meal into an unforgettable experience when you’re joined by \nsome of your favorite theme park characters. Have fun as they pose for \npictures, sign autographs, and interact with everyone at your table. Just  \nwait until you tell everybody back home who YOU had breakfast with!\nUniversal Meal Deal\nFor one low price, you can enjoy unlimited trips through the line at select \ntheme park restaurants from lunch through dinner.* Grab an entrée platter \nand dessert each time through! From spaghetti to pizzas to burgers to salads, \nthere’s a dish for everyone. You can even upgrade to include dinner at select \nCityWalk® restaurants (seasonal availability). Whether you’re staying one \nday or more, you can get a Meal Deal package that’s right for you.\nSEE PAGES 8 & 12 FOR PARTICIPATING RESTAURANTS.\nCharacter Breakfast and Universal Meal Deal \ncan be added to vacation packages booked through \nUniversal Parks & Resorts Vacations® .\n*Universal Meal Deal is a separate purchase. Separate theme park admission ticket required. Not valid during \nseparately ticketed special events at theme parks or CityWalk, such as Halloween Horror Nights. Excludes bev-\nerages, shakes, merchandise, breakfast, gelato, whole pizzas, Starbucks products, Ben & Jerry’s ice cream at \nCathy’s, Dippin’ dots ice cream at Circus McGurkus Cafe Stoo-pendous™, and ice cream window at International \nFood & Film Festival. Meal Deal ticket must be exchanged for a Meal Deal wristband at any participating restaurant \nwhich must be worn in order to take part in the Meal Deal Program. Children ages 9 and under must order from \nthe exclusive Meal Deal children’s menu only. Valid for one entrée platter and one dessert per trip through the \nfood service line. Sharing of food is NOT permitted. Food Service available from 11:00 am until 30 minutes prior \nto park closing. Tickets are non-refundable. Available for purchase at both parks date of purchase only. Separate \nCityWalk options available. No additional discounts apply. Additional restrictions may apply which are subject to \nchange without notice.\n38\nDelicious Dining \nAdd-Ons\n39\n\nRoyal Caribbean International® and Universal Orlando® Resort have teamed up to offer you an exclusive \nvacation that will make you say WOW.\nHARRY POTTER, characters, names and related indicia are trademarks of and © Warner Bros. Entertainment Inc. Harry Potter Publishing Rights © JKR. \n(s12)\nShrek 4-D © 2012 DreamWorks Animation L.L.C. © 2012 Universal Studios. Hard Rock Hotel ® Hard Rock Cafe International (USA), Inc. TM & © 2012 Marvel & Subs. †Requires paid theme \npark admission. Early Park Admission begins one hour prior to Universal’s Islands of Adventure regular opening hour for on-site hotel guests and is valid 7 days a week for travel through \n12/31/12, valid only at Harry Potter and the Forbidden Journey™, Flight of the Hippogriff™, Dragon Challenge™ and The Cat in the Hat™. Universal Express ride access is not valid during Early \nPark Admission. Additional restrictions may apply and the foregoing benefits are subject to change without notice. **Not valid at Harry Potter and the Forbidden Journey™ and other select \nattractions. On-site hotel privileges good for hotel stay as indicated on the room key card. Only good for the number of guests staying in the room. Paid theme park admission required. \nExpress ride access available during normal theme park operating hours only. Not valid for separately ticketed special events. *If visiting Universal Orlando® Resort first, guest must fly into \nOrlando and then will fly out of Tampa after their cruise. If cruising first, guest must fly into Tampa and then will fly out of Orlando after their visit to Universal Orlando® Resort. ***For group \nbookings at off-site hotels an additional transfer fee may occur between the hotel and park. Additional restrictions may apply and the foregoing benefits are subject to change without \nnotice. Universal elements and all related indicia TM & © 2011 Universal Studios. All rights reserved. Itineraries are subject to change without notice. Certain restrictions may apply. © 2012 \nRoyal Caribbean Cruises Ltd. Ships registered in the Bahamas. 11025877 • 10/2011\nWhat’s included?\n•  \n 3\n/4-Night Bahamas or 4/5/7-Night* Western Caribbean cruise onboard Royal Caribbean\n•  \n 3\n/4-day park admission* to Universal Studios Florida® and Universal’s Islands of Adventure®\n•  \n Enjo\ny Early Park Admission† to The Wizarding World of Harry Potter™, one hour before the theme park \nopens, plus receive FREE Universal ExpressSM ride access** to Skip The Regular Lines at both Universal \ntheme parks when you stay at one of three Universal Orlando on-site hotels (paid theme park  \nadmission required)\n•  All transfers throughout your trip***\nWhy should you book?\n•  Less expensive than booking each separately\n•  Easy to book, we take care of everything!\n•  Packages can be customized to fit your needs\n So wha\nt are you waiting for?  Come experience an adventure made for the whole family. Book now to take \nadvantage of this exclusive package.\nRoyalCaribbean.com/Universal\nTerms & Conditions\nHARRY POTTER, characters, names and related indicia are trademarks of and © Warner Bros. Entertainment Inc. Harry Potter Publishing Rights © JKR. BEETLEJUICE and all related characters and elements are trademarks of and © Warner Bros. \nEntertainment Inc.\n(s12)\nUniversal Parks & Resorts Vacations is registered with the State of Florida as a seller of travel. Registration number: ST-24215. TM & © 2012 Marvel & Subs. Dr. Seuss properties TM & © 2012 Dr. Seuss Enterprises, L.P. All rights reserved. Jurassic \nPark, Camp Jurassic, Jurassic Park Discovery Center, Jurassic Park River Adventure ® Universal Studios/Amblin. All Popeye characters TM & © 2012 KFS, Inc. TM Hearst Holdings, Inc. Rocky and Bullwinkle and Friends TM & © Ward Prods. Shrek 4-D \n© 2012 DreamWorks Animation L.L.C. Men In Black & Alien Attack: TM & © 2012 Columbia Pictures Industries, Inc. All rights reserved. T2, TERMINATOR ® StudioCanal Image, S.A. ALL RIGHTS RESERVED. Fear Factor TM & © 2012 Endemol Netherlands \nB.V. Fievel’s Playland ® Universal Studios/U-Drive J.V. Woody Woodpecker, Woody Woodpecker’s Nuthouse Coaster, Woody Woodpecker’s KidZone ® Walter Lantz. Curious George ®, created by Margret and H.A. Rey, is copyrighted and trademarked by \nHoughton Mifflin Harcourt Publishing Company and used under license. Licensed by Universal Studios Licensing, Inc. All rights reserved. The Barney name and character, related characters and the overlapping dino spots and Barney and star logos are \ntrademarks of Lyons Partnership, L.P. Reg. U.S. Pat. & Tm. Off. and other countries. The Blues Brothers © 2012 D. Aykroyd and J. Belushi Pisano. © 2012 Viacom International Inc. All Rights Reserved. THE SIMPSONS RIDE TM Twentieth Century Fox Film \nCorporation. The Simpsons TM & © 2012 Twentieth Century Fox Film Corporation. All rights reserved. Emeril’s ® Emeril Lagasse. Hard Rock Cafe, Hard Rock Live, Hard Rock Hotel, Camp Lil’ Rock ® Hard Rock Cafe International (USA), Inc. Jimmy Buffett’s \n® Margaritaville ® Jimmy Buffett. Bubba Gump Shrimp Co. TM & © 2012 Par. Pic. Latin Quarter TM Latin Quarter Entertainment, Inc. NASCAR®, NASCAR Sports Grille SM are trademarks of NASCAR, Inc. Pat O’Brien’s, Hurricane Glass logo, Have Fun! and \nIron Grill Design ® Pat O’Brien’s Bar, Inc. © 2012 Pat O’Brien’s Bar, Inc. All rights reserved. Hart & Huntington Tattoo Company ® Hart and Huntington LLC. All rights reserved. ©2012 BMP. ©2012 Busch Entertainment Corporation. All Rights Reserved. \n© 2012 Wet ‘n Wild Orlando. Loews Portofino Bay Hotel & Loews Royal Pacific Resort logos © 2012 Universal Rank Hotel Partners. All rights reserved. © 2012 InterContinental Hotels Group. All Rights Reserved. Holiday Inn and all related titles, logos and \ntrademarks are owned by Six Continents Hotels Inc. MACY’S THANKSGIVING DAY PARADE & RELATED CHARACTERS:  © 2012 Macy’s East, Inc. All rights reserved. Universal elements and all related indicia TM & © 2012 Universal Studios. © 2012 Universal \nOrlando. All rights reserved. Universal Parks & Resorts Vacations is registered with the State of Florida as a seller of travel. Registration number ST-24215. 249956/1111/JC\nGENERAL CONDITIONS\nThe information provided below is intended to inform you of the various taxes, governmental fees and other \ncharges on any travel-related transactions, fees and charges you may pay when you book your travel \narrangements with Universal Parks & Resorts Vacations. All prices shown are in U.S. Dollars and include \napplicable taxes, fees and charges, except as otherwise noted. Packages and rates are subject to change \nwithout notice.  Prices are subject to change based upon your choice of travel dates, number of travelers, \ndeparture city, and your choice of flight, hotels or other items, and may require a minimum nights’ stay. \nPackage prices are guaranteed upon full payment received by Universal Parks & Resorts Vacations, and \nsolely subject to change due to imposition of taxes or other charges by government authorities. Package \ninclusions and options subject to change without notice. All persons on the same reservation must purchase \nthe same package. \nPlease remember that you may incur other charges while traveling that are not included in the quoted pack-\nage price payable to Universal Parks & Resorts Vacations, such as hotel extra-person or extra-bed charges, \nresort fees, gratuities, hotel energy and/or telecommunications surcharges, parking fees, telephone fees, \nroom service, movies, mini-bar, or rental car insurance, gasoline, and other incidentals.\nAIR TRAVEL\nOnce booked, airline tickets are non-refundable. In the event you make changes or rebook your vacation \npackage, the original airfare paid may be applied toward a new ticket, subject to the airlines’ rules and regula-\ntions, as well as the payment of a re-ticketing fee and any differences in airfare amounts.  In the event you \ncancel and do not rebook your vacation package, you will need to make any changes to future travel \ndirectly with the airline, subject to its rules and regulations, as well as payment of a re-ticketing fee and any \ndifferences in airfare amounts.Your air transactions will be fulfilled using electronic ticketing. Paper tickets \nare not available. \nAirlines may cancel duplicate reservations without notice. Universal Parks & Resorts Vacations shall not be \nresponsible for any airline schedule changes, delays, cancellations, or any airline’s failure to perform for any \nreason including, but not limited to, strike, inclement weather, or bankruptcy. \nGuests are encouraged to reconfirm all flights directly with the airline since flight schedules are subject to change \nand are not guaranteed. Guests are responsible for any additional fees that may be charged by the airline (such \nas extra baggage or heavy baggage, beverages, movies, etc.). Any seat selection made at the time of booking \nis not guaranteed. If seat selection is unavailable through Universal Parks & Resorts Vacations, seats will be \nassigned at airport check in. Guests age 17 and younger must fly with an adult on the same itinerary and reserva-\ntion. If you are travelling with minors under the age of 18, please contact the airline directly for any safety regu-\nlations or other requirements. Please remember to bring a government-issued photo identification which is \nrequired for all air passengers 18 years and older. It is the responsibility of guests to provide full, legal names of \nall passengers, including the children’s ages at the time of booking.\nOf course, all air fares may be subject to additional restrictions, may not be available on all flights, and may \nchange without notice.\nTaxes and fees are charged per ticket and include, without limitation:\nS\nURCHARGES\n - various airline surcharges from $1.50 to over $50 may apply. \nF\nEDERAL\n E\nXCISE\n TA\nX\n - 7.5% of base fare (may be pro-rated for flights from US to Hawaii, Alaska and inter-\nnational destinations). A Travel Facilities Tax of up to $15.00 per roundtrip for domestic flights beginning or \nending in Alaska or Hawaii may apply. \nPASSENGER\n FA\nCILITY\n C\nHARGES\n - up to $18.00, depending on the itinerary. \nF\nEDERAL\n S\nEGMENT\n F\nEE\n - $3.40 per U.S. flight segment. \nS\nEPTEMBER\n 11\nTH\n S\nECURITY\n F\nEE\n - $2.50 per flight segment with a maximum  \nof $10.00 per ticket. \nHotels Accommodations\nHotel check-in is generally 4 p.m. Two double beds are standard in the room unless otherwise stated. \nCharges for in-room safes, rollaway beds and cribs, plus applicable taxes, are not included in the package \nprice and are payable directly to the hotel. Gratuities, resort fees, parking fees, laundry, telephone calls, \nmeals, beverages, sightseeing or any other incidentals at the hotel are the responsibility of the guest. \nAdjacent rooms and/or connecting rooms, room locations, types of bedding and smoking preferences are \non a request-only basis and subject to availability at the time of check-in. Please advise us of any special \nneeds at the time of booking.\nRevision Fees\nOnce deposit and/or full payment is received, a $50 revision fee per transaction, plus any applicable services fees \nor price increases, will be assessed for any changes made to the reservation including, but not limited to, dates, \nair carrier, hotel, and ground transportation. If your vacation includes airline reservations, change fees apply, \nplus a $50 per reservation revision fee and any other fees or price increases imposed by the airline will be \ncharged. Fees are non-refundable. Certain types of airline reservation changes, including name changes, are \nprohibited based upon restrictions imposed by the carrier.\nREFUNDS\nPlease allow 2-3 weeks for processing refunds.\nCAR RENTAL TRANSACTIONS  \nIf you keep a rental car longer than the original reservation, you must pay additional amounts, including \ntaxes, governmental fees and other charges, directly to the car rental agency when you return your rental \ncar. Any additional products or services that are offered to you by the car rental company at the time of \npick-up, must be paid directly by you to the car rental company. \nAttraction Ticket Purchases and Features \nAttraction tickets are non-refundable once purchased.  Discovery Cove requires a 14-day notice to avoid \nadditional cancellation fees. Additional terms and conditions apply regarding transactions including Blue \nMan Group show admission. Purchase of attraction tickets only must be paid in full at time of booking and \nare non-refundable. Additional restrictions may apply.  Theme parks, restaurants, shows, attractions, rides, \nentertainment and other services and features are subject to change without notice and may be closed \ntemporarily due to renovation, capacity, inclement weather, special events, or may otherwise be discontinued \nor changed without notice and without liability to Universal Parks & Resorts Vacations.\nDeposits/Payments\nAC CEPTABLE  FORMS  OF  PA YMENT  - We accept American Express®, MasterCard®, Discover® Card and Visa®. For final \npayment we also accept personal checks, travel agency checks, money orders and cashiers checks. We will \nnot accept third-party checks. Payments must be made in US$. Reservations booked within 45 days of \narrival must be paid with a credit card. \nFor reservations that include air travel, the total price of airline tickets are due at the time of booking and \nmust be paid in full, in addition to a deposit of per reservation as described below.\nVACATION PROTECTION PLAN\nVacation Protection Plan is non-refundable. Rates and coverage are subject to change without notice. \nInsurance only valid for residents of the United States and Canada.\nIMPORTANT: Certain conditions, exclusions, and other limitations may apply. For full terms and conditions of \ncoverage, please visit www.univacations.com/vacoptions. This program is administered by: Travel Guard. \nInsurance coverage is underwritten by the National Union Fire Insurance Company of Pittsburgh, PA. These \nnon-refundable and non-transferable plans must be purchased at the time of final payment. \nApplicable Law & Responsibility \nIt is agreed by and between you and Universal Parks & Resorts Vacations, that all claims, disputes and matters \nwhatsoever arising under or in connection with your booking and these policies and procedures shall be \ngoverned by the laws of the State of Florida (without regard to conflict of laws) and shall be litigated, if at \nall, in and before a court located in Orange County, Florida, USA, to the exclusion of the courts of any other \nstate or country. Universal Parks & Resorts Vacations is not responsible for any error or omission. Universal \nParks & Resorts Vacations is an independent wholesaler, and the services described are provided by indepen-\ndent contractors. Universal Parks & Resorts Vacations shall not be  responsible or liable in any way for any \nloss, injury (including personal injury), or any damage caused or arising in connection with customer’s \ntravel or other services or products provided through Universal Parks & Resorts Vacations, including but not \nlimited to, any transportation, accommodations, attractions, meals, or other services, due to any acts of God, \nweather, strikes, acts of Government or other authorities, wars, civil disturbances, hijacks, thefts, or any \nother circumstances beyond our control. The terms and conditions of the transportation providers (including \nall applicable tariffs) shall apply to all transportation services.\nUniversal Parks & Resorts Vacations ® is registered with the State of Florida as a seller of travel. Registration \nnumber: ST-24215.\nCANCELLATION FEE FOR BOOKINGS\nDAYS PRIOR TO ARRIVAL PENAL TIES\n46 days or more\n F\null refund*\n45 - 0 days\n $200 f\nee per reservation, plus fees imposed by \n  \n ho\ntel, airline and/or other components.\n*Additional Terms & Conditions apply regarding transactions including Vacation Protection \nPlan, air travel, Halloween Horror Nights, Blue Man Group, VIP Tours and Discovery Cove.\nDAYS PRIOR TO ARRIVAL P AYMENTS\n46 days or more\n $\n50 per person deposit, plus cost of Airfare, Vacation \n  \n Pr\notection Plan & select add-ons due at time of reservation. \n45 - 0 days\n F\null payment due at time of reservation. Packages booked with a  \n deposit will be aut\nomatically charged full payment.\nTHE AAA  \nDIAMOND \nRATING SYSTEM\nAAA inspects hotel properties \nannually and rates them based  \non the overall quality and service \noffered. The following can be \nused as a guide when selecting \nyour hotel.  \nAccommodations displaying a \nhigh level of service, hospitality \nand a variety of amenities and \nupscale facilities.\nProperties offer a degree  \nof sophistication, often  \nwith additional amenities  \nand facilities. A noticeable \nupgrade in physical attributes, \nservices and comfort.\nProperties offer good but  \nmodest accommodations,  \nwhile showing marked \nenhancements in décor and  \nfurnishings. They may be recently \nconstructed or older properties, \nboth targeting the needs of a \nbudget-oriented traveler. \nHotel ratings subject to change.\n40", "char_count": 77439, "word_count": 12303}
