{"file_name": "Happiest-Handbook.pdf", "source_path": "data/raw_pdfs/Happiest-Handbook.pdf", "content": "YOUR STRESS-FREE GUIDE TO \nWALT DISNEY WORLD WITH LITTLES\nthe happiest\nhandbook\nBY MCKENZIE FUSSELL\nPHOTOGRAPHY BY JESSIE OFFER PHOTOGRAPHY\n\nMckenzie\nI've been visiting Disney since I was baby (thanks mom + dad!) but\nmy very best trips, the most memorable ones, all took place over the\npast four years. The first trip with my oldest daughter Alba Grace in\nmy belly, the first time she met her beloved Daisy Duck, getting to\nbring sister Millie along with us. The best. Watching my girls hug\ntheir favorite princesses in their ice cream covered smocked\ndresses... those memories are priceless. I've visited the parks\nhundreds of times, but the days spent at Disney with my littles are\nthe days I've always dreamed of! Our family loves to make memories\nat Walt Disney World and I hope that within these pages you'll find\ntips that will help you make wonderful memories of your own! \nHi There!\nWELCOME\nABOUT ME\nMcKenzie is a wife, mother, and life-long\nDisney lover with a passion for sharing\nhelpful tips and tricks to make your Walt\nDisney World trip amazing!\n\n\"Happiness is the richest thing we will ever own:\n- Donald Duck\n\n01 Know Before You Go\n02Getting Started\nINDEX\n \n03Where To Stay \n04Disney Dining\n05 Planning Your Park Days\n06Pro Tips\n\nCHAPTER ONE\nKNOW BEFORE YOU GO\nIn this chapter I'll share my three golden rules for\nWalt Disney World trips with littles and how our\ntravel mindset makes every trip special!\n\nchapter 1\nSo you want to take your little ones to Disney? Maybe you're planning your\nvery first trip or maybe you'd consider yourself a WDW pro. Either way,\nsuccessful adventures with kiddos require both planning AND patience. Most\nimportantly, they require realistic expectations. Which means that you've got\nto prioritize. \nI'm sorry to be the one to tell you this, but if you want to have a great Disney\ntrip with kids, you're not going to be able to tackle everything on your\nwishlist. Coming to terms with this reality (before you drive under the\nmagical Mickey gates!) is truly the best way to enjoy a stress-free vacation.\nYou're likely not going to ride every rollercoaster in the Magic Kingdom or\ncatch every show, but I promise your trip will be one for the books!\n \nGather up your family and dream together. List your top three attraction\npriorities for each day of your trip (rides) then your top two experiences (ex:\ncatching a Magic Kingdom parade + meeting Minnie Mouse) and one dining\nreservation you'd love to score. Once you've got your list of must-do's each\nday, jot down a few other adventures you'd love to squeeze in. If those things\ndon't happen, that's okay. If they do, it's a major win! Setting the bar low\nmakes planning your days so much more manageable and leaves room for the\nunexpected Disney magic you'll find around every corner of the parks! \n \nPrioritize\n\nperfect disney\nday equation:\n3 attractions\n+ \n2 experiences\n+ \n1 dining\nreservation\n\n01\n02\n03\nTODAY'S\nPRIORITIES:\n \nATTRACTIONS\nEXPERIENCES\n01\n02\nDINING\n01\n\n01\n02\n03\nTODAY'S\nPRIORITIES:\n \nATTRACTIONS\nEXPERIENCES\n01\n02\nDINING\n01\n\n01\n02\n03\nTODAY'S\nPRIORITIES:\n \nATTRACTIONS\nEXPERIENCES\n01\n02\nDINING\n01\n\n01\n02\n03\nTODAY'S\nPRIORITIES:\n \nATTRACTIONS\nEXPERIENCES\n01\n02\nDINING\n01\n\n01\n02\n03\nTODAY'S\nPRIORITIES:\n \nATTRACTIONS\nEXPERIENCES\n01\n02\nDINING\n01\n\nI've heard it said that your family is only as old as your youngest child,\nso we take that into consideration on all of our trips. We move at a\ntoddler pace on most of our park days and in my opinion, it's the best\nway to do Disney! We try our very best not to overplan and to let the\nlittles lead. Taking it slow means fewer meltdowns and more room for\nunexpected magic. \n \nFriends, I'm here to tell you that there is no meltdown like a sweaty,\nsugary, Disney meltdown! So let's avoid those. Okay?! \nchapter 1\nTake It Slow\n\nchapter 1\nI know my type A readers are cringing at the title\nof this page but this pep talk is for you so stay\nput! Things won't always go your way at Disney\nso flexibility is #important. \nFlorida weather is unpredictable, regardless of what the\nforecast shows you. Rides break down (sometimes when\nyou're on them.) Toddlers decide to boycott public restrooms\n(speaking from recent experience here!) and sometimes we\nforget to pack essentials. Things go wrong. Flexibility is the\nname of the game at Disney. Plans will need to be tweaked\nand changed throughout the day according to wait times and\nnap schedules. As our girl Elsa likes to say, \"Let it\ngooooooooo\", roll with the punches and make the most of it.\nPut a smile on your face and treat yo' self to a dole whip or\ntwo! You're at Disney after all! :) \n \nBe Flexible\n\nGolden Rule #1\nPrioritize!\nGolden Rule #2\nTake It Slow!\nGolden Rule #3\nBe Flexible! \n\n“Happiness is a state of mind. It’s just according to\nthe way you look at things.\" \n- Walt Disney\n\nCHAPTER TWO\nGETTING STARTED\nNow that we're all on the same page with our\ntravel philosophy, let's get to work!\nResearching, dreaming and planning for your\nDisney trip is part of the fun! \n\nFor those new to the world of Disney, research is your first step. If you've\npurchased this e-book I can already tell that you'll love this phase of planning\nyour Disney vacation. This is the part where you dream up the type of Disney\ntrip you'd like to have and get your family excited about what's to come.\nchapter 2\nResearch\nA few of my favorite sources for research:\n \nWebsites & Youtube: Disney Food Blog + All Ears\nYoutube Search Words: Disney Vlog, WDW Resort Tour, WDW Room Tour,\nWDW Rides, WDW Tips\nFacebook Groups: Disney With Littles, Smart Moms Planning Disney, Taking\nTots To Disney, TBBC Mama's Planning Disney\n \n \n\nchapter 2\nDid you know that you can hire a Disney planner to\nhelp with your trip for free?! Yep! They are paid by\nDisney, so hiring one will only SAVE you money!\nHiring a Disney planner can be a huge help, even for Disney pros like myself!\nPlanners will do the \"dirty work\" for you so that you can focus on your family\nwhile on vacation. They'll wake up early to book your dining reservations, stay on\ntop of promotions and deals Disney launches during the planning process, and\nhelp you maximize your time in the parks! The really  good ones will also make\nthemselves available to answer your questions and help with any hiccups you may\nencounter during your Disney stay. Travel agents are in the know when it comes\nto changes in park policies and health info so you'll always be in the loop.\nHiring a Planner\nNeed a recommendation? \n \nMary Helen Law, Mouse Counselor, IG @maryhelen_mousecounselor\nCourtney Callicutt, Mouse Counselor IG @courtneyc_mousecounselor\nNatalie Alfant, Mouse Counselor IG @nataliealfant_mousecounselor\n\nIf you're asking, \"how far out can I start planning my trip\" then today is as good\nas any! There's no harm in starting the research process more than a year out,\nbut the sweet spot for booking is 6-12 months out. Many of our trips are planned\nin just a few months and sometimes we're even more spontaneous than that.\nPerks of being just a few hours down the road I suppose!\n \nAnd now to answer the burning question... when's the best time visit?!\nThe answer is different for every family but you'll want to pay close attention to\ncrowd levels (check out magicguides.com), weather (summer is HOT!) as well as\nfestivals & after hours events your family may be interested in. Visiting while\nschool is still in session (avoiding school holidays) is always a good idea!\nchapter 2\nWhen To Get Started\n\nready to go?\nstep 1: book room \n(or hire your planner!)\nstep 2: purchase tickets & link\nto park reservations\nstep 3: make dining\nreservations\nstep 4: set up\ntransportation\nstep 5: countdown, make\nyour gameplan, get excited!\n\n“Any day spent with you is my favorite day.\nSo, today is my new favorite day.” \n— Pooh (Winnie the Pooh)\n\nCHAPTER THREE\nWHERE TO STAY\nThere's so much to consider when it comes to\nDisney resorts. But this is a guide to stress-free\nDisney trips with littles so we'll use that for our\nranking order!\n\ndisney resort\nperks:\non-site transportation is a\nhuge convenience with littles\nin tow!\nearly park entry\n (30 minutes sooner than other\nguests!)\n7am lightning lane access\nbook dining reservations 70\ndays out\n\nMonorail resorts make mid-day Magic Kingdom naps possible. Some of these\nresorts are close enough that you can even walk to the Magic Kingdom! Five star\nfireworks views, the best dining on property and all of the deluxe resort\namenities you can dream up. The monorail resorts are the most convenient\nchoice for a Disney vacay with young kids. But be warned, they'll come with the\nheftiest price tag. \n \nThe Grand Floridian, The Polynesian & The Contemporary are Disney's\nmonorail resorts. My favorite is the Grand Floridian. (Regardless of where you\nstay, you must visit the Grand Floridian lobby on your trip to hear the lobby\npianist.) The monorail runs to these three resorts as well as to Epcot & Magic\nKingdom! We love the monorail because you DO NOT have to fold your stroller\nunlike Disney busses. \nchapter 3\nMonorail Resorts\n\nIf a monorail resort isn't for you, consider a Skyliner resort. Disney's\nopen-air skyliner system can transport you from The Riviera (Deluxe\nResort), Carribean Beach (Moderate Resort), Pop Century (Value\nResort), & Art of Animation (Value Resort) to Hollywood Studios or\nEpcot!\n \nMy favorite skyliner resorts are The Riviera & Art of Animation (check\nout the family suites!) Pop Century is a great value resort option, with\nrecently updated rooms!\n \n*Note: You will have to fold your double stroller up on the skyliner so do\ntake that into consideration. Single strollers can remain open.\nchapter 3\nSkyliner Resorts\n\nSwan & Dolphin: \n \nEpcot is our family favorite and we're Marriott Cardholders so the Swan &\nDolphin (the only Marriott owned Disney property) are a no-brainer for us. Epcot\narea resorts are worth considering if your family is planning an Epcot day\nbecause you can walk or take a quick boat ride over. *The Boardwalk, Beach Club\n& Yacht Club are in the Epcot bubble and also worth considering if this sounds\nappealing!\n \nchapter 3\nHonorable Mentions\nOld Key West: \n \nOKW is a DVC (Disney Vacation Club) property (which means you can rent points\nto save $$$ - check out MouseSavers.com) our family loves the slow laid back vibe,\nHUGE rooms, many pools, on-site dining & water taxi to Disney Springs!\n \n\ndisney\ntransportation\nBUS SYSTEM\n \nDisney's most used (and most unreliable) mode of\ntransportation. The busses are convenient in that you don't\nhave to drive but you will have to to plan for possible\ndelays and the inconvenience of folding up your stroller! \nMONORAIL\n \nMy favorite way to get around! The monorail will take\nyou to Magic Kingdom Ticket & Transportation as well\nas to all three of the monorail resorts. You can also hop\non the monorail to switch between Epcot & The Magic\nKingdom. Typically very reliable but I did recently get\nstuck on the monorail for 45 minutes so you really never\nknow!\n \n \n \n \n \n \nSKYLINER\n \nThis open-air gondola system conveniently connects\nDisney's Hollywood Studios and International\nGateway at Epcot to the following Resort hotels:\nDisney's Caribbean Beach Resort, Disney's Art of\nAnimation Resort, Disney's Pop Century Resort and\nDisney's Riviera Resort.\n*Don't want to rely on Disney's free transportation services?\nConsider driving your own car or using Uber, Lyft, or Disney's\nown Minnie Van service! \n\nairport\ntransportation\nMEARS CONNECT\n \nStandard riders could be the first or last stop so it's\nnot confirmed how long your ride will be. Minimal\nwait for express. $91-$250 (standard vs express)\n \nSUNSHINE FLYER\n \nGreat affordable ($93) option for a larger family.\nKeep in mind that it could take up to 65 minutes\nbefore you arrive at your stop. You'll love the magical\ntheming!\nUBER, LYFT OR MINNIE VANS\n \nThe cost for an SUV with car seat is around $207. In a\nstandard lyft or uber Car seat options cannot be\nbooked ahead of time so you'll want to book a Minnie\nVan if carseats are necessary just to be safe.\nPRIVATE CAR SERVICES\n \nThe only option with no wait! Cost is approximately\n$250. HappyLimo comes highly recommended! With\nthis option you can add carseats or boosters.\n\n“They say if you dream a thing more than once,\nit’s sure to come true” – Sleeping Beauty\n \n\nCHAPTER FOUR\nDISNEY DINING\nIn my opinion, the best part of any vacation is the food!\nMickey shaped food tastes even better. You might be\nsurprised to learn that Disney World dining isn't all hot\ndogs and plastic cheese! There's a little somethin' for\neveryone, even the most adventurous eaters!\n\nCharacter dining is a Disney must. An easy way to \"kill two birds with one\nstone\", knocking out a meal AND hanging out with characters at the same time.\nYou'll have a unique character experience your littles are sure to remember! In\nmy opinion, character dining is one of the best parts of a Disney vacation. I'd\nrecommend you book at least one during your visit. \n \nBreakfast at Topolino's Terrace is our family favorite character experience! \n Reservations for this one can be harder to snag but it's well worth stalking the\nDisney website & signing up for Mouse Dining alerts for. \n \nYou can find character dining experiences in several resorts and in each of the\nDisney World parks. You'll find different characters and unique theming at\neach restaurant.\nchapter 4\nCharacter Dining\n\nThere are hundreds of in-park dining options\nranging from snack kiosks and quick service\nrestaurants to sit down dining experiences fit for\neven the biggest foodies. I like having a reservation\nfor one sit down restaurant each day (especially in\nthe Magic Kingdom where quick service options\naren't the tastiest.\nchapter 4\nIn-Park Dining\n\nchapter 4\nIn-Park Dining\nRESERVATIONS TO SNAG!\n \nMAGIC KINGDOM\n \nBe Our Guest (character dining), Crystal Palace (buffet and previously character\ndining), Skippers Canteen (delicious options for adventurous eaters,  hilarious staff\nand most impressive kids menu!), Cinderella's Royal Table\n \nANIMAL KINGDOM\n \nYak & Yeti (one of my favorite restaurants on property!), Tusker House (character\ndining!) and Rain Forest Cafe for more adventurous littles! Tiffins is a TREAT but not\nthe most kid-friendly option.\n \nHOLLYWOOD STUDIOS\n \nHollywood Brown Derby (order the Cobb salad and thank me later!), Hollywood & Vine\n(underwhelming food but the littles will ADORE the character interactions!) and Tune\nIn Lounge. Oh wait, that last one's not a restaurant but we can't visit HS without\npopping in for drinks and AC!\n \nEPCOT\n \nWe are team #snackaroundtheworld in Epcot but have also tried many of the\nrestaurants. Our favorites have been Tutto Italia (decent food, better wine list!) and\nanything in Mexico! You really can't go wrong eating in any of the countries!\n \n \n \n \nM\n(buff\n\nFinding a resort that has on-site dining options you love is always a win\nbut don't forget that you can make reservations to dine at any Disney\nresort! It's a fun way to explore the property and scope out your next\nresort destination. \n \nFavorite Resort Dining:\n \nCitricos at The Grand Floridian\nFlying Fish at The Boardwalk\nBeaches & Cream at The Beach Club\nOlivia's at Old Key West\nSteakhouse 71 at The Contemporary\n \nchapter 4\nResort Dining\n\nWith plenty of magical shops to explore, live music, tons of dining\noptions and even a few kid-friendly rides like a train & carousel, Disney\nSprings is always a hit with our girls! Definitely worth scheduling an\nevening at Disney Springs on your next trip.\n \nDisney Springs Favorites:\n \nThe Boathouse\nHomecomin' \nD Luxe Burger\nGiddeon's Bakeshop\n \nchapter 4\nDisney Springs Dining\n\nchapter 4\nDining Reservations\nResort guests can make dining reservations 70 days out. If you don't see\na reservation for a specific spot right away, do not fear! I'll share my\nfavorite hack with you! \n \nI've scored all of our best dining reservations using the Mouse Dining\nwebsite (www.mousedining.com) to sign up for alerts. I suggest using the\npaid membership option so that you can add multiple phone numbers to\nthe alerts! The system works by triggering text messages when a dining\nreservation is dropped so you'll need to act fast when you get the text!\n \nStill haven't scored a reservation by your park day? Once in the parks,\nyou can join walk up lists for restaurants that have availability!  Keep\nan eye on the dining reservations tab of the app throughout the day. \n \n \n\nchapter 4\nSnacking & Groceries\nSnacks are part of the Disney experience! We don't overdo it with the dining reservations so\nthat we can overindulge in Mickey pretzels and popcorn throughout our day. My favorite\nWDW snacks are the Cat Tail from Cheshire Cafe in the Magic Kingdom, Corn & Pork Tacos\nfrom the Margarita Stand in Epcot's Mexico pavilion, Macarons from Epcot's France pavilion,\negg rolls from Epcot's China pavilion and churros from any kiosk offering them! :)\n \nDisney Food Blog has some of the best up-to-date guides for snacking in the parks, you can\neven print their guide to take with you! \n \nEpcot is the most exciting park for snacking, especially during a festival! You can enjoy small\nbites from around the world while taking in some of the prettiest spots in WDW! \n \nYou can bring your own snacks and drinks into the parks as well. We packs tons of snacks to\nkeep the littles in good spirit all day long! Disney even allows cooler bags as long as there is no\nloose ice. \n \nWe like to bring groceries to our room to save on drinks, snacks and breakfast! Sign up for\nInstacart and have your groceries delivered straight to your room before check-in.\n \n\n\"This much I know. If you are what you eat,\nthen I only wanna eat the good stuff.\"\n- Ratatouille\n\nCHAPTER FIVE\nPLANNING YOUR DAYS\nRefer back to our perfect formula for\nstress free Disney days and let's get to\nplanning!\n\nticket options\n& park hopping\nThe ticket offerings change frequently\nso I don't want to share the specifics\nhere but instead to fill you in on the\nbasics.\n \nPark Hopper tickets give you an\noption to visit more than one park in\na day. Park hopping is such a\npersonal decision so you'll want to\nweigh the pros and cons for your\nfamily. Park hopping can be a bit\nmore challenging for little ones (lots\nof transportation) and it's an added\nexpense. But if you're only visiting\nDisney for a few days, it might be\nworth considering! My \"stress-free\"\ntip here: if you're on the fence, don't\ndo it. There's plenty to experience in\neach park and don't forget, you'll be\nmoving at the pace of your littles!\n \n\nENTERING THE\nPARK\nOnce you've arrived at the park you'll need to\nget through security and then make your way\nover to the entrance where you'll scan your\nticket or magic band. \n \nWe now have this (sometimes stressful!)\nprocess down to a science so I want to share\nhow we navigate with two kiddos, bags, and a\nstroller.\n \nI grab the bags from under the stroller\n(typically just our backpack, sometimes a\ncooler bag or busy bag and then a bag that\nholds our stroller rain cover) and make my\nway through the individual security gate\nwhile my husband pushes the girls through the\nstroller lane. We let the girls know in advance\nthat they MUST stay in the stroller during\nthis process! Sometimes Disney security will\nwant to further search our bags and\nsometimes they won't. Being prepared with\nbags in hand + unzipped if necessary helps\nthe process run smoothly!\n \n \n\nThe My Disney Experience app is your new best friend! Spend time getting to know\nit before your trip! When visiting with kiddos these features will be the most helpful\nto understand:\n \n*How to use the map feature to view wait times, find baby care centers, restrooms,\nnearby dining, character experiences and entertainment opportunities. \n \n*Using the mobile food order feature to order ahead quick service food before\narriving at the kiosk\n \n*Check Daily park hours and closed attractions\n \n*Use the resort hotel feature to check-in, explore resort amenities and even unlock\nthe door to your room!\n \n \n \nchapter 5\nKnow The App\n\nDisney Genie is the complimentary offering that is now available to all guests visiting Walt Disney World. Walt Disney\nWorld guests will access the tool within the existing My Disney Experience app at Walt Disney World and Disneyland\nguests will use the Disneyland app to access Disney Genie.\n \nDisney Genie provides a real-time Tip Board with customized recommendations for experiences, wait times and next\nshowtimes, and Lightning Lane return times; restaurant waitlist, check-in and reservations; mobile order; and access to\nattraction virtual queues (currently available for Remy’s Ratatouille Adventure).\n \nAhead of or on the day of their visit, guests can input their “Top Picks” for attractions, entertainment and dining, as well\nas their park-hopping plans, and Disney Genie will generate a recommended itinerary based on these selections.\n \nPro tip: Disney Genie recommendations are just that — suggestions. If Genie adds something to your itinerary that you’re\nnot interested in doing, you can remove it and Genie will re-optimize your day with new recommendations. Within\nDisney Genie, guests have the option to purchase Disney Genie+, a paid add-on that enables guests to bypass the standby\nqueue and instead use the Lightning Lane (previously the FastPass entry) for most attractions. The cost is $15 plus tax per\nperson, per day at Walt Disney World and $20 plus tax per person per day at Disneyland, where Disney Genie+ also\nincludes free Disney PhotoPass downloads.\n \nOnce purchased for the day, Disney Genie+ can be used in all parks by guests with park hopper tickets at no additional\ncost. Disney Genie+ gives guests Lightning Lane access to special attractions!\n \n \nchapter 5\nGenie +\n\nAs part of the Disney Genie service, guests to Walt\nDisney World now have two ways to access\nLightning Lanes (the newest version of Fastpass).\nThose are the daily Genie+ service, or by\npurchasing Individual Lighting Lane access for\nspecific attractions.\n \n \nchapter 5\nLightning Lane\n\nLIGHTNING LANE\nTIPS\nFor Genie+, you want to have completed your\npurchase before you try to make your first\nbooking. To purchase, you can buy through the My\nDisney Experience app starting at midnight.\nAt 7 a.m., everyone is able to start making their\nfirst Genie+ reservation, and guests staying at\nselect Walt Disney World resort hotels can begin\nmaking Individual Lightning Lane reservations.\nSo, to have the best selection, you will want to\nstart as close to 7 a.m. as possible.\n \nMake additional selections as soon as possible. If\nyour Genie+ selections are more than 2 hours in\nthe future, pay attention to the exact time your\ninitial selection was made, and be ready on the\napp to make another selection 2 hours later. If\nyour selection is inside that 2 hour line, you can\nmake a new selection as soon as your final entry\nscan is complete, so keep an eye on whether that is\none or two touchpoints for the attraction you are\nentering.\n \n\nLIGHTNING LANE\nTIPS\nFor those who are booking Lightning Lane\nreservations later in the day, you can\nalso “stack” reservations close to each\nother. This will allow you to experience\nnumerous attractions in quick succession.\nYou’ll just want to make sure you give\nyourself enough time to both experience\nthe attractions and travel to the next.\n*Be sure to watch a youtube video on\n\"stacking\" to hear strategy from the pros! \nGuests are also able to book a Lightning\nLane reservation for a park that they\nhave not yet park hopped to. So, if you\nare planning on hopping, you can make\na reservation before you begin your\ntravel to save time upon arrival.\n\nWhile I think you can have a great day at Disney\nwithout a single ride, the attractions are part of the\nfun! Not sure what attractions your kiddos will like?\nYou can watch YouTube videos of the attractions prior\nto your trip to get a feel for their interests! You never\nknow what your littles will enjoy and we're always\nsurprised by what our girls like and don't like.\nPreparation and research is key! \nchapter 5\nAttractions\n\nmust- do park\nattractions\nFOR LITTLES\n \nMAGIC KINGDOM\n \nAnything and everything in Fantasyland, Aladdin's Magic Carpets, The\nPeople Mover, Buzz Lightyear, Monster's Inc Laugh Floor, Jungle Cruise\n \n \nANIMAL KINGDOM\n \nKilamanjaro Safari, Na'vi River Journey, TriceraTop Spin, It's A Bug's Life\n(Not recommended for kids under 5!)\n \n \nHOLLYWOOD STUDIOS\n \nToy Story Mania, Alien Swirling Saucers, Slinky Dog Dash, Mickey &\nMinnie's Runaway Railway, Disney Junior Play & Dance\n \n \nEPCOT\n \nFrozen Ever After, Spaceship Earth, Living With the Land, Turtle Talk with\nCrush, The Seas with Nemo & Friends, Gran Fiesta Tour\n \n \n\ntips for waiting\nin line \nBubble wands for outdoor\nlines! It's Disney so I promise\nthis is socially acceptable!\nLet your kiddos cover you (or\nthemselves!) in stickers.\n \nHave your kids play guide,\nlooking through a Disney map!\nTell the story behind the ride!\nHave a snack! Long lines and\ncheerios just go together.\n \nSearch for hidden Mickeys!\n\nheight\nrequirements\ncheat sheet\n*If a ride is not listed here, it does not have a height requirement!\nThe Barnstormer – 35 inches \nBig Thunder Mountain Railroad –  40 inches\nSeven Dwarfs Mine Train – 38 inches \nSpace Mountain – Guests must be 44 inches \nSplash Mountain –  40 inches \nTomorrowland Speedway – 32 inches \nMission: SPACE –  40 inches \nSoarin’ Around the World –  40 inches\nTest Track –40 inches \nAlien Swirling Saucers – 32 inches \nMillennium Falcon: Smugglers Run –38 inches\nRock ‘n’ Roller Coaster Starring Aerosmith – 48 inches\nSlinky Dog Dash – 38 inches \nStar Tours – 40 inches \nStar Wars: Rise of the Resistance – 40 inches \nThe Twilight Zone Tower of Terror™ –40 inches\nAvatar Flight of Passage – 44 inches\nDINOSAUR –  40 inches \nExpedition Everest –  44 inches\nKali River Rapids – 38 inches \n \n\nOne of the best things about Disney with littles is\nthat they're not quite tall enough for all of the thrill\nrides, leaving more time for experiences like\nparades, shows, character meet & greets and\nfireworks! These are some of the most special and\nmemorable moments at Disney World!\nchapter 5\nExperiences\n\nhow to find\ncharacter meet\n& greets\nThe easiest way to find character meet-and-greets is\nthe My Disney Experience app. Offering up-to-the-\nminute information on where and when characters\nwill be greeting guests and, depending on the meet-\nand-greet, how long it will take to see them. \n \nYou can even make a Genie+ reservation to meet\ncertain characters. However, if you’d rather not be\nplugged into your phone all day , you can also look\non the Times Guide or ask a guest relations cast\nmember. \n \nMeet-and-greets can also happen unannounced at\nrandom times and places. These unexpected\nappearances can often be some of the rarer\ncharacters you’ll meet. \n \nIf there’s a character you or your kids absolutely\ncan’t miss, the easiest ways to guarantee it happens\nis by booking a Disney character meal, making a\nLightning Lane reservation (if available) or making\nsure you’re first in line for their next meet-and-\ngreet. \n \n\ncharacter meet\n& greet tips\nHave your autograph book open and\nready - don't forget a pen or marker!\nWatch character meet-and-greet\nvideos at home so your littles know\nwhat to expect!\nAsk questions and engage! Characters\nare here to interact, not just post for\nphotos.\nAt the end of your experience a cast\nmember will snap a photo that you\ncan access in the app! You can also\nask them to use your phone or camera\nfor a photo. \n\nparades &\ncalvalcades\nLet's be real. The parades are THE BEST part\nof Disney! Grab a Mickey Bar and scout out\nyour spot at least 30 min in advance! If you're\ntraveling with family, this is a good time to\nsplit up and let grandma (insert: whoever\nwants a break!) scope out the perfect parade\nviewing spot for your group.\n \nCurrently there are two scheduled parades in\nthe Magic Kingdom, in addition to pop-up\ncavalcades (a fun way to see tons of characters!)\nin all four parks. These two parades are Disney\nFestival of Fantasy (timeless parade with tons\nof movie characters!) and Move It! Shake It!\nStreet Dance Party (Interactive dance party\nparade with Mickey & friends!)\n \nThe easiest way to find the Disney cavalcade &\nparade times is in the My Disney Experience\napp. The app also gives map locations on where\nto find the routes and a quick description of\nwhat happens during each one. These showtimes\nare given for all four Walt Disney World parks.\n\nfirworks\nFireworks are a hit or miss for little ones. \nMy kiddos aren't big fans of loud noises (even\nwith sound-blocking headphones!) but if\nyours are, you'll absolutely LOVE the\nfireworks show at Disney! \n \nThere are currently two shows - one in Epcot\nand one in Magic kingdom. Typically Epcot's\nfireworks start after Magic Kingdom's\nfireworks. If you're deciding between the two,\nI much prefer the show at Magic Kingdom\nlargely due to the beautiful castle projections!\nCheck the app for showtimes and \n \nThe easiest way to find the Disney cavalcade &\nparade times is in the My Disney Experience\napp. The app also gives map locations on where\nto find the routes and a quick description of\nwhat happens during each one. These showtimes\nare given for all four Walt Disney World parks.\n\nLIVE SHOWS\nLive shows have a way of bringing everything\nyour littles love about Disney to LIFE!\n \nFrom interactive training labs and animal\nencounters to classic broadway style sing-a-\nlongs, there is a show for everyone!\n \nThere are tons of kid-friendly shows in each of\nthe four parks! Don't skip these. A great way to\nget a break in the AC and experience something\ncompletely captivating.\n \nOUR FAVORITE SHOWS:\n \nBeauty & The Beast (Hollywood Studios)\nCountry Bear Jamboree (Magic Kingdom)\nDisney Junior Play & Dance (Hollywood Studios)\nBeauty & The Beast Singalong (Epcot)\nFrozen Singalong (Hollywood Studios)\nTurtle Talk with Crush (Epcot)\nMickey's Friendship Faire (Magic Kingdom)\nMickey's Philharmagic (Magic Kingdom)\nImpressions De France (Epcot)\nCarousel of Progress (Magic Kingdom)\nFestival of The Lion King (Animal Kingdom)\nFinding Nemo (Animal Kingdom)\n \n\nnon- park\nactivities\nMonorail or Skyliner \"hopping\" to\nexplore other resorts! \nMini Golf at Fantasia Gardens or\nSummerland Miniature!\nGrab a dining reservation at\nanother resort or visit one of the\nresort lounges!\nExplore Disney Springs. With tons of\nstores, entertainment, restaurants and\neven a train ride + carousel, this is a\nmust-do!\nEnjoy your resort! Play at the\nplayground or soak up the kiddie pool!\nStroll Disney's Boardwalk to enjoy fun\nrestaurants and live entertainment!\n\nplaygrounds\nwithin the parks\nMAGIC KINGDOM\n \nYou'll find four play spaces in Magic Kingdom perfect to let\nkids run wild in! Under Spash Mountain, inside the Dumbo\nattraction, across from theBarnstormer ride and on Tom\nSawyer's Island! \nEPCOT\n \nEpcot has one year-round playground (located next to\nConnections Cafe) as well as a seasonal playground during\nthe Flower & Garden Festival at the front of the world\nshowcase entrance. This is my kiddos favorite park because\nthere are so many areas to play within the World Showcase\nas well! Raining? There's an indoor play area located inside\nNemo's aquariam!\nANIMAL KINGDOM\n \nThe boneyard playground in Dinoland is huge! You’ll also\nfind some interactive play areas throughout the park. Like\na drumming section in Africa and a Drumming Section in\nPandora.\nHOLLYWOOD STUDIOS\n \nWhile Hollywood Studios doesn't currently have a\ndesignated playground - we love to let the kids run around\nEcho Lake near The 50's Prime Time Cafe!\n\n“That’s the real trouble with the world, too\nmany people grow up. They forget.”\n- Walt Disney\n\nCHAPTER SIX\nPRO TIPS\nA quick guide to my Disney tips & tricks you\nneed to know about! \n\nPack your own princess dresses &\ncostumes to bring out for special\noccasions like dinner! \nStop by Sir Mickey's for a little \"pixie\ndust\" magic! A fun freebie your little one\nwill love.\nAny kiosk with a soda fountain will\ngladly provide you with free cups of\nwater!\n\nKeep a note in your phone with your itinerary,\nscreenshots of photo spots and details on things\nyou'd like to do as you're researching! While\nyou're in the parks keep adding for next trip!\nFlattened pennies make for a fun interactive\n(and super affordable!) souvenir! Find kiosks\naround the parks to collect your favorites. \nVisit the dollar store prior to your trip to fill a\n\"bag of tricks\" up with small prizes to keep\nlittles entertained or to let them choose from\nwhen gift shop toys aren't on your radar. \n\nInvest in a bubble wand! Disney has kindly\nreplaced ours three times (no guarantee!) and\nit provides for endless entertainment! What's\nmore fun than bubbles?!\nWhile there aren't many \"crowd-free\" days at\nWDW, you can check Disney's crowd calendar\nonline to find the best possible times to travel!\nIn the summer we typically avoid midday in\nthe park! Early morning and early evenings\nare great but anytime between 12 and 3 is\nmiserably hot. This is a great time to head back\nto the room for naps or splash in the pool!\n\nCharacter meals and experiences can be\noverwhelming for littles. Limit character meals\nto just one per day or per trip!\nI always recommend renting or traveling to\nDisney with a stroller! Even for older kids. We\nLOVE our Zoe Double Luxe stroller for Disney!\nDon't forget your stroller tag!\nAs someone who loves taking photos with my\n\"nice camera\" I rarely bring it into the parks. It's\none less thing to keep up with and the times I\nhave brought it I've found myself quickly\nreaching for my iPhone instead. \n\nGift shops after rides are impossible to avoid.\nLet kids snap a picture of things they'd like for\nChristmas or Birthdays or offer them a small\nprize out of your bag of tricks!\nThe best way to save on your Disney trip is to\nhire a planner that can help you stay on track!\nYou might also choose to stay at a value resort,\nif so we love Art of Animation & Pop Century!\nFree souvenir idea: stop by guest services for\nan \"I'm celebrating\" or \"First Visit\" button for\neveryone in your party!\n\nDon't skip Epcot with little ones! There are fun\nKidcot stops in each of the countries, tons of\ncharacters and the slower pace is perfect for\ntoddlers! Ours ADORE the trains in Germany!\nSave this for the end of the trip BUT if your\nlittles seem to have a post-fireworks burst of\nenergy, the few hours before park close are the\nbest times to ride #allthethings in Magic\nKingdom!\nMama, always pack a change of clothes! You\nnever want to say no to a splash pad or\nMickey Bar because you didn't pack\naccordingly.\n\nWant to get into a park before the crowds? \nGrab the earliest breakfast reservation available!\nIf you can't snag a breakfast reservation we\nrecommend \"rope dropping\" or arriving 30 min\nbefore park opening!\nInvest in a silicone strap attachment for\nyour stroller. Clip water bottles to said\nstrap. No more lost water bottles or sippy\ncups. Thank me later!\nIf you're a nursing or pumping mama, I\nalways preferred to bring a hand pump but\nyou can nurse or use an electric pump in the\nbaby care centers! These are also great spots\nto change diapers and grab baby essentials!\n\nWorried about your stroller? \nAttach an apple air tag just in case!\nSnap a family photo at your resort before\nentering the parks, just in case you forget to\ngrab one while you're there! And while we're\ntalking photos, the best castle photo spot is to\nthe right of the castle near Cinderella's well!\nTeach your little ones your full name and to\nfind another mommy or a cast member (help\nthem understand what a cast member looks\nlike!) incase they get separated.\n\n\"Laughter is timeless, imagination has no age,\nand dreams are forever.\"\n- Walt Disney\n\nwhat to wear\nFOR MAMA\n \nWithin the Disney parks you'll find a little bit of\neverything. So if you're comfortable in athleisure, you'll\nfit right in. And if you're more comfortable dressing up a\nbit, you'll fit right in! I personally prefer to dress up on\nour park days. Choosing an outfit that fits the theme of\nthe park is part of the fun IMO! I rock sneakers in the\nwinter and Target's sun & sand line sandals in the spring\n& summer. My preference is a cute top and shorts or a\ndress with biker shorts underneath making it easy to\nbend over and chase littles! I typically pair with a big\nsunhat or themed Minnie Ears! My girls love when I wear\nears! :) Fanny packs or backpacks are my\nrecommendation to free up your hands!\nFOR LITTLES\n \nI love a smocked Disney dress or shorts set! Anything\nwith a mickey head or character is a hit with my littles\nand gets them pumped for the adventure. It's also so\nsweet to see them meet the character they're wearing!\nWe pack princess dresses for special dinners or\nnighttime activities but rarely wear them all day\n(hello, FL heat!) which makes them even more special.\nWe take tons of photos while at Disney so making sure\nthey're in something that's comfy AND cute is part of\nthe fun! As mentioned, sandals (we love Sun Sans and\nFootmates!) are my go-to's at Disney if the weather\npermits. Rain happens, and soggy sneakers are the\nworst! Be sure to follow along on Instagram for outfit\ninspo! \n\ndisney bagchecklist\nRain Coats\nPonchos\nHand Sanitizer\nMasks\nBubble Refills\nBubble Wand\nGlow Sticks\nHats\nSunglasses\nQuiet Time Activities\nChange of Clothes\n- Backup Outfits\n- Costume\nLiquid IV\nWater Bottles\nSnacks\nMagic Bands\nFuel Rod\nPressed Coin Book\nAutograph Book\nTowel\nIbuprofen\nChapstick\nBlister Balm \nBandaids\nHair Ties\nStain Treater\nFacial Mist\nZiploc Bags\nWet Wipes\nDiapers\nSunscreen\nStroller Tag\nMommy Hook \nClip-on Fan\n\nTHANK YOU!\nThanks so much for allowing me\nto be a part of your Walt Disney\nWorld vacation!\n \nFor more Disney content and to\nfollow along with our monthly\nDisney trips, follow along here:\n \nBlog: mckenziefussell.com\n \nInstagram: @mckenziefussell\n \n \n \nSee ya real soon! ;)", "char_count": 37691, "word_count": 6434}
